[
  {
    "kind": "article",
    "url": "TEST 1",
    "source": "The Hacker News",
    "title": "APT28 Hacker Group Targeting Europe, Americas, Asia in Widespread Phishing Scheme",
    "text": "The Russia-linked threat actor known as APT28 has been linked to multiple ongoing phishing campaigns that employ lure documents imitating government and non-governmental organizations (NGOs) in Europe, the South Caucasus, Central Asia, and North and South America.\n\"The uncovered lures include a mixture of internal and publicly available documents, as well as possible actor-generated documents associated with finance, critical infrastructure, executive engagements, cyber security, maritime security, healthcare, business, and defense industrial production,\" IBM X-Force said in a report published last week.\nThe tech company is tracking the activity under the moniker ITG05, which is also known as Blue Athena, BlueDelta, Fancy Bear, Fighting Ursa, Forest Blizzard (formerly Strontium), FROZENLAKE, Iron Twilight, Pawn Storm, Sednit, Sofacy, TA422, and UAC-028.\n\nThe disclosure comes more than three months after the adversary was spotted using decoys related to the ongoing Israel-Hamas war to deliver a custom backdoor dubbed HeadLace.\nAPT28 has since also targeted Ukrainian government entities and Polish organizations with phishing messages designed to deploy bespoke implants and information stealers like MASEPIE, OCEANMAP, and STEELHOOK.\nOther campaigns have entailed the exploitation of security flaws in Microsoft Outlook (CVE-2023-23397, CVSS score: 9.8) to plunder NT LAN Manager (NTLM) v2 hashes, raising the possibility that the threat actor may leverage other weaknesses to exfiltrate NTLMv2 hashes for use in relay attacks.\n\nThe latest campaigns observed by IBM X-Force between late November 2023 and February 2024 leverage the \"search-ms:\" URI protocol handler in Microsoft Windows to trick victims into downloading malware hosted on actor-controlled WebDAV servers.\nThere is evidence to suggest that both the WebDAV servers, as well as the MASEPIE C2 servers, may be hosted on compromised Ubiquiti routers, a botnet comprising which was taken down by the U.S. government last month.\n\nThe phishing attacks impersonate entities from several countries such as Argentina, Ukraine, Georgia, Belarus, Kazakhstan, Poland, Armenia, Azerbaijan, and the U.S., putting to use a mix of authentic publicly available government and non-government lure documents to activate the infection chains.\n\"In an update to their methodologies, ITG05 is utilizing the freely available hosting provider, firstcloudit[.]com to stage payloads to enable ongoing operations,\" security researchers Joe Fasulo, Claire Zaboeva, and Golo Mühr said.\nThe climax of APT28's elaborate scheme ends with the execution of MASEPIE, OCEANMAP, and STEELHOOK, which are designed to exfiltrate files, run arbitrary commands, and steal browser data. OCEANMAP has been characterized as a more capable version of CredoMap, another backdoor previously identified as used by the group.\n\"ITG05 remains adaptable to changes in opportunity by delivering new infection methodologies and leveraging commercially available infrastructure, while consistently evolving malware capabilities,\" the researchers concluded.\n\n\nFound this article interesting? Follow us on Twitter  and LinkedIn to read more exclusive content we post.",
    "created": 1710741540,
    "keywords": [
      "APT28",
      "botnet",
      "Cyber warfare",
      "cybersecurity",
      "Malware",
      "NTLMv2",
      "phishing attack",
      "Spear Phishing",
      "WebDAV"
    ]
  },
  {
    "kind": "article",
    "url": "TEST 2",
    "source": "The Hacker News",
    "title": "New DEEP#GOSU Malware Campaign Targets Windows Users with Advanced Tactics",
    "text": "A new elaborate attack campaign has been observed employing PowerShell and VBScript malware to infect Windows systems and harvest sensitive information.\nCybersecurity company Securonix, which dubbed the campaign DEEP#GOSU, said it's likely associated with the North Korean state-sponsored group tracked as Kimsuky.\n\"The malware payloads used in the DEEP#GOSU represent a sophisticated, multi-stage threat designed to operate stealthily on Windows systems especially from a network-monitoring standpoint,\" security researchers Den Iuzvyk, Tim Peck, and Oleg Kolesnikov said in a technical analysis shared with The Hacker News.\n\"Its capabilities included keylogging, clipboard monitoring, dynamic payload execution, and data exfiltration, and persistence using both RAT software for full remote access, scheduled tasks as well as self-executing PowerShell scripts using jobs.\"\nA notable aspect of the infection procedure is that it leverages legitimate services such as Dropbox or Google Docs for command-and-control (C2), thus allowing the threat actor to blend undetected into regular network traffic.\nOn top of that, the use of such cloud services to stage the payloads allows for updating the functionality of the malware or delivering additional modules.\nThe starting point is said to be a malicious email attachment containing a ZIP archive with a rogue shortcut file (.LNK) that masquerades as a PDF file (\"IMG_20240214_0001.pdf.lnk\").\nThe .LNK file comes embedded with a PowerShell script as well as a decoy PDF document, with the former also reaching out to an actor-controlled Dropbox infrastructure to retrieve and execute another PowerShell script (\"ps.bin\").\n\nThe second-stage PowerShell script, for its part, fetches a new file from Dropbox (\"r_enc.bin\"), a .NET assembly file in binary form that's actually an open-source remote access trojan known as TruRat (aka TutRat or C# RAT) with capabilities to record keystrokes, manage files, and facilitate remote control.\nIt's worth noting that Kimsuky has employed TruRat in at least two campaigns uncovered by the AhnLab Security Intelligence Center (ASEC) last year.\nAlso retrieved by the PowerShell script from Dropbox is a VBScript (\"info_sc.txt\"), which, in turn, is designed to run arbitrary VBScript code retrieved from the cloud storage service, including a PowerShell script (\"w568232.ps12x\").\nThe VBScript is also designed to use Windows Management Instrumentation (WMI) to execute commands on the system, and set up scheduled tasks on the system for persistence.\n\nAnother noteworthy aspect of the VBScript is the use of Google Docs to dynamically retrieve configuration data for the Dropbox connection, allowing the threat actor to change the account information without having to alter the script itself.\nThe PowerShell script downloaded as a result is equipped to gather extensive information about the system and exfiltrate the details via a POST request to Dropbox.\n\"The purpose of this script appears to be designed to serve as a tool for periodic communication with a command-and-control (C2) server via Dropbox,\" the researchers said. \"Its main purposes include encrypting and exfiltrating or downloading data.\"\nIn other words, it acts as a backdoor to control the compromised hosts and continuously keep a log of user activity, including keystrokes, clipboard content, and the foreground window.\nThe development comes as security researcher Ovi Liber detailed North Korea-linked ScarCruft's embedding of malicious code within Hangul Word Processor (HWP) lure documents present in phishing emails to distribute malware like RokRAT.\n\n\"The email contains a HWP Doc which has an embedded OLE object in the form of a BAT script,\" Liber said. \"Once the user clicks on the OLE object, the BAT script executes which in turn creates a PowerShell-based reflective DLL injection attack on the victims machine.\"\nIt also follows Andariel's exploitation of a legitimate remote desktop solution called MeshAgent to install malware like AndarLoader and ModeLoader, a JavaScript malware meant for command execution.\n\"This is the first confirmed use of a MeshAgent by the Andariel group,\" ASEC said. \"The Andariel Group has been continuously abusing the asset management solutions of domestic companies to distribute malware in the process of lateral movement, starting with Innorix Agent in the past.\"\n\nAndariel, also known by the names Nicket Hyatt or Silent Chollima, is a sub-cluster of the notorious Lazarus Group, actively orchestrating attacks for both cyber espionage and financial gain.\nThe prolific state-sponsored threat actor has since been observed laundering a chunk of the crypto assets stolen from the hack of crypto exchange HTX and its cross-chain bridge (aka HECO Bridge) through Tornado Cash. The breach led to the theft of $112.5 million in cryptocurrency in November 2023.\n\"Following common crypto-laundering patterns, the stolen tokens were immediately swapped for ETH, using decentralized exchanges,\" Elliptic said. \"The stolen funds then lay dormant until March 13, 2024, when the stolen crypto assets began to be sent through Tornado Cash.\"\nThe blockchain analytics firm said that Tornado Cash's continuation of its operations despite sanctions have likely made it an attractive proposition for the Lazarus Group to conceal its transaction trail following the shutdown of Sinbad in November 2023.\n\"The mixer operates through smart contracts running on decentralized blockchains, so it cannot be seized and shut down in the same way that centralized mixers such as Sinbad.io have been,\" it noted.\n\n\nFound this article interesting? Follow us on Twitter  and LinkedIn to read more exclusive content we post.",
    "created": 1710784560,
    "keywords": [
      "cryptocurrency",
      "Cybercrime",
      "cybersecurity",
      "data exfiltration",
      "encryption",
      "Keylogging",
      "Kimsuky",
      "Malware",
      "powershell",
      "Remote Access Trojan",
      "Tornado Cash",
      "VBScript"
    ]
  },
  {
    "kind": "article",
    "url": "TEST 3",
    "source": "The Hacker News",
    "title": "Fortra Patches Critical RCE Vulnerability in FileCatalyst Transfer Tool",
    "text": "Vulnerability / Threat Mitigation\nFortra has released details of a now-patched critical security flaw impacting its FileCatalyst file transfer solution that could allow unauthenticated attackers to gain remote code execution on susceptible servers.\nTracked as CVE-2024-25153, the shortcoming carries a CVSS score of 9.8 out of a maximum of 10.\n\"A directory traversal within the 'ftpservlet' of the FileCatalyst Workflow Web Portal allows files to be uploaded outside of the intended 'uploadtemp' directory with a specially crafted POST request,\" the company said in an advisory last week.\n\"In situations where a file is successfully uploaded to web portal's DocumentRoot, specially crafted JSP files could be used to execute code, including web shells.\"\n\nThe vulnerability, the company said, was first reported on August 9, 2023, and addressed two days later in FileCatalyst Workflow version 5.1.6 Build 114 without a CVE identifier. Fortra was authorized as a CVE Numbering Authority (CNA) in early December 2023.\nSecurity researcher Tom Wedgbury of LRQA Nettitude has been credited with discovering and reporting the flaw. The company has since released a full proof-of-concept (PoC) exploit, describing how the flaw could be weaponized to upload a web shell and execute arbitrary system commands.\nAlso resolved by Fortra in January 2024 are two other security vulnerabilities in FileCatalyst Direct (CVE-2024-25154 and CVE-2024-25155) that could lead to information leakage and code execution.\nWith previously disclosed flaws in Fortra GoAnywhere managed file transfer (MFT) coming under heavy exploitation last year by threat actors like Cl0p, it's recommended that users have applied the necessary updates to mitigate potential threats.\n\n\n\nFound this article interesting? Follow us on Twitter  and LinkedIn to read more exclusive content we post.",
    "created": 1710766680,
    "keywords": [
      "Fortra",
      "Information security",
      "Patch Management",
      "Proof-of-Concept",
      "remote code execution",
      "technology",
      "Threat Mitigation",
      "Vulnerability",
      "Web Shell"
    ]
  },
  {
    "kind": "article",
    "url": "TEST 4",
    "source": "The Hacker News",
    "title": "Hackers Using Sneaky HTML Smuggling to Deliver Malware via Fake Google Sites",
    "text": "Cybersecurity researchers have discovered a new malware campaign that leverages bogus Google Sites pages and HTML smuggling to distribute a commercial malware called AZORult in order to facilitate information theft.\n\"It uses an unorthodox HTML smuggling technique where the malicious payload is embedded in a separate JSON file hosted on an external website,\" Netskope Threat Labs researcher Jan Michael Alcantara said in a report published last week.\nThe phishing campaign has not been attributed to a specific threat actor or group. The cybersecurity company described it as widespread in nature, carried out with an intent to collect sensitive data for selling them in underground forums.\nAZORult, also called PuffStealer and Ruzalto, is an information stealer first detected around 2016. It's typically distributed via phishing and malspam campaigns, trojanized installers for pirated software or media, and malvertising.\n\nOnce installed, it's capable of gathering credentials, cookies, and history from web browsers, screenshots, documents matching a list of specific extensions (.TXT, .DOC, .XLS, .DOCX, .XLSX, .AXX, and .KDBX), and data from 137 cryptocurrency wallets. AXX files are encrypted files created by AxCrypt, while KDBX refers to a password database created by the KeePass password manager.\nThe latest attack activity involves the threat actor creating counterfeit Google Docs pages on Google Sites that subsequently utilize HTML smuggling to deliver the payload.\nHTML smuggling is the name given to a stealthy technique in which legitimate HTML5 and JavaScript features are abused to assemble and launch the malware by \"smuggling\" an encoded malicious script.\nThus, when a visitor is tricked into opening the rogue page from a phishing email, the browser decodes the script and extracts the payload on the host device, effectively bypassing typical security controls such as email gateways that are known to only inspect for suspicious attachments.\nThe AZORult campaign takes this approach a notch higher by adding a CAPTCHA barrier, an approach that not only gives a veneer of legitimacy but also serves as an additional layer of protection against URL scanners.\nThe downloaded file is a shortcut file (.LNK) that masquerades as a PDF bank statement, launching which kicks off a series of actions to execute a series of intermediate batch and PowerShell scripts from an already compromised domain.\n\nOne of the PowerShell scripts (\"agent3.ps1\") is designed to fetch the AZORult loader (\"service.exe\"), which, in turn, downloads and executes another PowerShell script (\"sd2.ps1\") containing the stealer malware.\n\"It executes the fileless AZORult infostealer stealthily by using reflective code loading, bypassing disk-based detection and minimizing artifacts,\" Michael Alcantara said. \"It uses an AMSI bypass technique to evade being detected by a variety of host-based anti-malware products, including Windows Defender.\"\n\"Unlike common smuggling files where the blob is already inside the HTML code, this campaign copies an encoded payload from a separate compromised site. Using legitimate domains like Google Sites can help trick the victim into believing the link is legitimate.\"\nThe findings come as Cofense revealed the use of malicious SVG files by threat actors in recent campaigns to disseminate Agent Tesla and XWorm using an open-source program called AutoSmuggle that simplifies the process of crafting HTML or SVG smuggled files.\n\nAutoSmuggle \"takes a file such as an exe or an archive and 'smuggles' it into the SVG or HTML file so that when the SVG or HTML file is opened, the 'smuggled' file is delivered,\" the company explained.\nPhishing campaigns have also been observed employing shortcut files packed within archive files to propagate LokiBot, an information stealer analogous to AZORult with features to harvest data from web browsers and cryptocurrency wallets.\n\"The LNK file executes a PowerShell script to download and execute the LokiBot loader executable from a URL. LokiBot malware has been observed using image steganography, multi-layered packing and living-off-the-land (LotL) techniques in past campaigns,\" SonicWall disclosed last week.\nIn another instance highlighted by Docguard, malicious shortcut files have been found to initiate a series of payload downloads and ultimately deploy AutoIt-based malware.\nThat's not all. Users in the Latin American region are being targeted as part of an ongoing campaign in which the attackers impersonate Colombian government agencies to send booby-trapped emails with PDF documents that accuse the recipients of flouting traffic rules.\nPresent within the PDF file is a link that, upon click, results in the download of a ZIP archive containing a VBScript. When executed, the VBScript drops a PowerShell script responsible for fetching one of the remote access trojans like AsyncRAT, njRAT, and Remcos. \n\nFound this article interesting? Follow us on Twitter  and LinkedIn to read more exclusive content we post.",
    "created": 1710765300,
    "keywords": [
      "AZORult",
      "Cofense",
      "cryptocurrency",
      "cybersecurity",
      "digital forensics",
      "HTML Smuggling",
      "Information Stealer",
      "Malspam",
      "Malware",
      "phishing attack",
      "powershell"
    ]
  },
  {
    "kind": "article",
    "url": "TEST 5",
    "source": "The Hacker News",
    "title": "WordPress Admins Urged to Remove miniOrange Plugins Due to Critical Flaw",
    "text": "Website Security / Vulnerability\nWordPress users of miniOrange's Malware Scanner and Web Application Firewall plugins are being urged to delete them from their websites following the discovery of a critical security flaw.\nThe flaw, tracked as CVE-2024-2172, is rated 9.8 out of a maximum of 10 on the CVSS scoring system and discovered by Stiofan. It impacts the following versions of the two plugins -\n\nMalware Scanner (versions <= 4.7.2)\nWeb Application Firewall (versions <= 2.1.1)\n\nIt's worth noting that the plugins have been permanently closed by the maintainers as of March 7, 2024. While Malware Scanner has over 10,000 active installs, Web Application Firewall has more than 300 active installations.\n\"This vulnerability makes it possible for an unauthenticated attacker to grant themselves administrative privileges by updating the user password,\" Wordfence reported last week. \n\nThe issue is the result of a missing capability check in the function mo_wpns_init() that enables an unauthenticated attacker to arbitrarily update any user's password and escalate their privileges to that of an administrator, potentially leading to a complete compromise of the site.\n\"Once an attacker has gained administrative user access to a WordPress site they can then manipulate anything on the targeted site as a normal administrator would,\" Wordfence said.\n\"This includes the ability to upload plugin and theme files, which can be malicious zip files containing backdoors, and modify posts and pages which can be leveraged to redirect site users to other malicious sites or inject spam content.\"\nThe development comes as the WordPress security company warned of a similar high-severity privilege escalation flaw in the RegistrationMagic plugin (CVE-2024-1991, CVSS score: 8.8) affecting all versions, including and prior to 5.3.0.0.\nThe issue, addressed on March 11, 2024, with the release of version 5.3.1.0, permits an authenticated attacker to grant themselves administrative privileges by updating the user role. The plugin has more than 10,000 active installations.\n\"This vulnerability allows authenticated threat actors with subscriber-level permissions or higher to elevate their privileges to that of a site administrator which could ultimately lead to complete site compromise,\" István Márton said.\n\n\nFound this article interesting? Follow us on Twitter  and LinkedIn to read more exclusive content we post.",
    "created": 1710755160,
    "keywords": [
      "cybersecurity",
      "malware scanner",
      "privilege escalation",
      "Vulnerability",
      "Web Application Firewall",
      "Wordfence",
      "WordPress"
    ]
  },
  {
    "kind": "article",
    "url": "TEST 6",
    "source": "darkreading",
    "title": "South African Government Pension Data Leak Fears Spark Probe",
    "text": "Source: Christophe Coat via AlamySouth African government officials are investigating reports that a ransomware gang stole and then leaked online 668GB of sensitive national pension data.The alleged compromise of the Government Pensions Administration Agency (GPAA) data on March 11 has not yet been publicly confirmed, but the incident has already made national news in South Africa. The South African Government Employees Pension Fund (GEPF) stepped in to probe the claims by the notorious LockBit cybercrime gang.GEPF is a top pension fund in South Africa, whose customers include 1.2 million current government employees as well as 473,000 pensioners and other beneficiaries.\"The GEPF is engaging with the GPAA and its oversight authority, the National Treasury, to establish the veracity and impact of the reported data breach and will provide a further update in due course,\" the pension fund explained in a public statement.Not Properly Secured?GPAA reportedly reassured the GEPF that it has acted to secure systems while the breach investigation was underway. However, preliminary investigations suggest that the LockBit claims may be related to a security incident the GPAA experienced in February.The agency claimed an attempt to hack into its systems on Feb. 16 was unsuccessful, but that claim came under fire after the alleged LockBit leak. GPAA said in a public post on Feb. 21 that it shut down systems and isolated the potentially affected systems in response to what it characterized as an attempt to \"gain unauthorized access to GEPF systems.\"The agency said its administration system had not been breached.\"It looks like the right steps have been taken to ensure data safety following the incident by securing the compromised servers,\" says Matt Aldridge, principal solutions consultant at OpenText Cybersecurity. \"However, the incident raises concerns about the overall security posture and resilience of the organization's systems.\"Aftermath to Operation CronosThe apparent attack against the GPAA comes just weeks after the Operation Cronos takedown, a law enforcement-led effort to disrupt the operations of LockBit and its ransomware-as-a-service affiliates.LockBit and its partners took a blow from this action but have since resumed attacks using new encryptors and a rebuilt infrastructure, including a new leak site.Amir Sadon, director of research at Sygnia, an incident response consultancy, says LockBit also set up a new data leak site and is recruiting \"experienced pen testers.\"\"LockBit's rapid adaptation underscores the challenges of permanently neutralizing cyber threats, especially those with sophisticated operational and organizational capabilities,\" he notes.Other experts caution that the leak of data from GPAA may stem from an attack that actually predates the Feb. 19 Operation Cronos takedown, so it would be rash to infer that LockBit is already back to full operational strength.\"The Government Pensions Administration Agency (GPAA) reported an attempted breach on Feb. 16 — prior to the takedown announcement,\" says James Wilson, a cyber threat intelligence analyst at ReliaQuest. \"It is therefore plausible that LockBit are using an old attack as the basis of this claim in order to project the image that they have maintained their threat capacity.\"LockBit is the most prolific ransomware group globally, and by far the most active ransomware gang in South Africa, accounting for 42% of attacks there in the last 12 months, according to Malwarebytes research shared with Dark Reading.Ransomware groups like LockBit try to build a brand to attract affiliates and to ensure victims pay up. \"Since Operation Cronos, LockBit will have been working hard to [re]gain the trust of affiliates, so the leak will be used as a way to demonstrate that they are continuing 'business as usual,'\" says Tim West, director, threat intelligence and outreach at WithSecure.Ransomware actors such as those behind LockBit primarily exploit two techniques to infiltrate companies: leveraging legitimate accounts and targeting vulnerabilities in public-facing applications.They typically steal copies of a victim's data before they encrypt it to have two forms of leverage during ransom negotiations. Then they demand payment in return for the data, threatening the release of the information through leak sites if ransom isn't paid.Thwarting Ransomware AttacksAdopting proactive defense strategies is crucial to defending against the growing threat posed by ransomware attacks. For example, adding multifactor authentication (MFA) adds an extra verification step, complicating attackers' efforts to exploit compromised accounts or vulnerabilities.Up-to-date backups that are regularly tested, endpoint protection, and threat detection capabilities all fortify systems against a ransomware attack. And managing vulnerabilities and mitigating their potential impact before they can be patched also hardens systems against ransomware.Christiaan Beek, senior director of threat analytics at Rapid7, says \"maintaining oversight of firewalls and VPNs is vital, as they present appealing entry points for unauthorized access.\"Beek adds that management and administrative interfaces of public-facing applications also must be secured.About the Author(s)Contributing WriterJohn Leyden is an experienced cybersecurity writer, having previously written for the Register and Daily Swig.Image source: Dorota Szymczyk via Alamy Stock Photo",
    "created": 1710745200
  }
]