[
  {
    "kind": "article",
    "url": "TEST 7",
    "source": "The Verge",
    "title": "Apex Legends postpones competition amid hacking concerns",
    "text": "Apex Legends has postponed the North America finals for its Global Series championship over concerns that hackers have compromised the “competitive integrity” of the game. Two professional players from major teams were targeted while livestreaming on Sunday by an attack that forcibly applied advantage-granting cheats during competitive gameplay.The cause of these attacks hasn’t been officially verified, leading to speculation that the hack may have been delivered via Apex Legend’s anti-cheat protections. An exchange posted by a cheat monitoring account on X claims that the attacker found an RCE, or remote code execution, exploit to run their code directly on the players’ computers. A Twitch clip of DarkZero’s Noyan “Genburten” Ozkose shows a UI interface for aimbot software appearing on his screen, at the same moment that a message reading “Apex hacking global series by Destroyer2009 & R4ndom” begins repeatedly spamming chat. “I’m getting hacked,” Genburten said, while raising his hands to show he was no longer in control. Genburten noticed he could see other players through walls and promptly abandoned the match.TSM’s Phillip “ImperialHal” Dosen was also targeted, with admins shutting down the game lobby after the player realized an aimbot had been applied to his account. While not much is known about “R4ndom” — one of the two aliases mentioned during Genburten’s hack — “Destroyer2009” is recognized for previous questionable activity targeting Apex Legends players like ImperialHal and Mande.Neither EA nor Respawn Entertainment have announced when the finals are expected to resume or if the hack presents any risk to wider Apex Legends players. The official Apex Legends Esports account on X says that more information will be shared “soon.” We have reached out to both companies for comment and will update this story if we hear back.",
    "created": 1710770924
  },
  {
    "kind": "article",
    "url": "TEST 8",
    "source": "The Verge",
    "title": "Adobe Substance 3D’s AI features can turn text into backgrounds and textures",
    "text": "While many developers are working out how generative AI could be used to produce entire 3D objects from scratch, Adobe is already using its Firefly AI model to streamline existing 3D workflows. At the Game Developers Conference on Monday, Adobe debuted two new integrations for its Substance 3D design software suite that allow 3D artists to quickly produce creative assets for their projects using text descriptions.The first is a “Text to Texture” feature for Substance 3D Sampler that Adobe says can generate “photorealistic or stylized textures” from prompt descriptions, such as scaled skin or woven fabric. These textures can then be applied directly to 3D models, sparing designers from needing to find appropriate reference materials.The second feature is a new “Generative Background” tool for Substance 3D Stager. This allows designers to use text prompts to generate background images for objects they’re composing into 3D scenes. The clever thing here is that both of these features actually use 2D imaging technology, just like Adobe’s previous Firefly-powered tools in Photoshop and Illustrator. Firefly isn’t generating 3D models or files — instead, Substance is using 2D images produced from text descriptions and applying them in ways that appear 3D.The new Text to Texture and Generative Background features are available in the beta versions of Substance 3D Sampler 4.4 and Stager 3.0, respectively. Adobe’s head of 3D and metaverse, Sébastien Deguy, told The Verge that both features are free during beta and have been trained on Adobe-owned assets, including reference materials produced by the company and licensed Adobe stock.",
    "created": 1710770059
  },
  {
    "kind": "article",
    "url": "TEST 9",
    "source": "The Verge",
    "title": "Qualcomm’s new 8S Gen 3 targets not-quite flagship phones",
    "text": "Qualcomm just launched a new chipset that’s designed to sit just below its current flagship in terms of capabilities and price. The Snapdragon 8S Gen 3 aims to bring most of the 8 Gen 3’s features — including support for on-device generative AI models — to more affordable phones. It represents a new tier for the top-of-the-line 8-series chips, and it’s also a little bit confusing.Before we get into all that, let’s start with the straightforward stuff: the 8S Gen 3 includes a GPU similar to the standard 8 Gen 3, though it has one less performance core and runs at a lower frequency — the prime core runs at up to 3.0GHz versus 3.4GHz on the 8 Gen 3. The new 8S Gen 3 also uses a previous-gen modem, the X70 5G, which includes Wi-Fi 7 support. There’s also support for hardware-accelerated ray tracing so photorealistic games run more smoothly, which seems to be kind of a benchmark of phone flagship-iness these days.Naturally, there’s AI. The 8S Gen 3 supports multimodal generative AI on-device and can run large language models of up to 10 billion parameters — that includes the likes of Llama 2 and Gemini Nano. It doesn’t offer all of the AI capabilities of the Snapdragon 8 Gen 3, but it does support gen AI virtual assistants and image expansion.The way Qualcomm’s Deepu John, senior director of product management, explains it, each Snapdragon high-level tier can be broken down into three sub-categories. There are Snapdragon 8, 7, 6, and 4 series chipsets, and within those, up to three different offerings. This “S” series chip sits just below the standard 8 Gen 3, and if Qualcomm ever releases an 8 Plus Gen 3, it would sit on top. Got it? Great, it gets even more confusing when you remember that phone manufacturers are still using 2022’s flagship, the Snapdragon 8 Gen 2 in not-quite flagship phones like the OnePlus 12R. There’s also the Snapdragon 7 Gen 3 sitting just below the 8S Gen 3, though it has only turned up in a handful of phones. Qualcomm seems to be slicing the high-end phone market awfully thin, maybe in an attempt to keep OEMs from turning to MediaTek for their less-than-flagship devices. In any case, the 8S Gen 3 should start appearing on the market soon enough, though not in devices readily sold in the US. Honor, iQOO, Realme, Redmi, and Xiaomi have all said that they’ll be using the platform, with new devices expected “in the coming months.”",
    "created": 1710743400
  },
  {
    "kind": "article",
    "url": "TEST 10",
    "source": "The Verge",
    "title": "Microsoft to hold a special Windows and Surface AI event in May",
    "text": "Microsoft is holding an AI event in the morning on Monday, May 20th — right before Build 2024 starts. In an invite emailed to media, Microsoft says CEO Satya Nadella will talk about the company’s “AI vision across hardware and software.”The event won’t be livestreamed and will only be open to journalists who attend the event in person. Microsoft’s special event will focus on upcoming Surface hardware and changes to Windows that are all focused on AI. While the software giant is holding a business-focused Surface event later this week, sources familiar with Microsoft’s plans tell The Verge that the May 20th event will include the consumer versions of the Surface Pro 10 and Surface Laptop 6.These consumer Surface devices will run on Qualcomm’s latest Snapdragon X Elite processors, and include dedicated NPU hardware for accelerating AI tasks in Windows 11. Microsoft is also working on a new AI Explorer feature for Windows 11 that’s designed to work as a timeline you can search through on your PC. Windows Central reports that it will catalog everything you do on your PC so you can search for moments, much like the Timeline feature in Windows 10 that Microsoft eventually removed.This event will also set the stage for “the year of the AI PC,” as Microsoft has described it. Partners including AMD, Intel, and Qualcomm are all ready to ship processors for Microsoft’s big Windows AI push, but we’re waiting to hear when Windows will be ready to take advantage of these new chips and laptops.The May 20th event will also include other parts of Microsoft’s AI initiatives, including Copilot. Microsoft recently launched its $20 per month Copilot Pro subscription worldwide, which lets users access the latest OpenAI models in Microsoft Office apps.Microsoft Build starts on Tuesday, May 21st and runs through May 22nd. There, Microsoft says it will share updates on “AI, Copilots, and more.” The event will take place both in person in Seattle and online.",
    "created": 1710782611
  },
  {
    "kind": "article",
    "url": "https://www.theverge.com/2024/3/18/24104843/dhs-ai-pilot-programs-chatgpt-openai-anthropic-meta",
    "source": "TEST 11",
    "title": "Homeland Security is testing AI to help with immigration, trafficking investigations, and disaster relief",
    "text": "The Department of Homeland Security (DHS) is rolling out three $5 million AI pilot programs across three of its agencies, The New York Times reports. Through partnership with OpenAI, Anthropic, and Meta, DHS will test out AI models to help its agents with a wide array of tasks, including investigating child sex abuse materials, training immigration officials, and creating disaster relief plans.As part of the AI pilot, the Federal Emergency Management Agency (FEMA) will use generative AI to streamline the hazard mitigation planning process for local governments. Homeland Security Investigations (HSI) — the agency within Immigration and Customs Enforcement (ICE) that investigates child exploitation, human trafficking, and drug smuggling — will use large language models to quickly search through vast stores of data and summarize its investigative reports. And US Citizenship and Immigration Services (USCIS), the agency that conducts introductory screenings for asylum seekers, will use chatbots to train officers.DHS’s announcement is scant on details, but the Times report provides a few examples of what these pilots may look like in practice. According to the Times, USCIS asylum agents will use chatbots to conduct mock interviews with asylum seekers. HSI investigators, meanwhile, will be able to more quickly search its internal databases for details on suspects, which DHS claims could “lead to increases in detection of fentanyl-related networks” and “aid in identification of perpetrators and victims of child exploitation crimes.”To accomplish this, DHS is building up an “AI corps” of at least 50 people. In February, DHS Secretary Alejandro Mayorkas traveled to Mountain View, California — famously the headquarters of Google — to recruit AI talent, and wooed potential candidates by stressing that the department is “incredibly” open to remote workers.Hiring enough AI experts isn’t DHS’s only hurdle. As the Times notes, DHS’s use of AI hasn’t always been successful, and agents have previously been tricked into investigations by AI-generated deepfakes. A February report from the Government Accountability Office, which looked into two AI use cases within the department, found that DHS hadn’t used reliable data for one investigation. Another case hadn’t relied on AI at all, despite DHS claiming it had. Outside of DHS, there are plenty of documented cases of ChatGPT spitting out false results, including an instance in which a lawyer submitted a brief citing nonexistent cases that the AI model had completely made up.Still, this expansion isn’t DHS’s first foray into AI. Some of the surveillance towers Customs and Border Protection (CBP) uses to monitor the US-Mexico border, such as those made by Anduril, use AI systems to detect and track “objects of interest” as they move across the rugged terrain of the borderlands. CBP hopes to fully integrate its network of surveillance towers through AI by 2034. The agency also plans to use AI to monitor official border crossing zones. Last year, CBP awarded a $16 million contract to a tech and travel company founded by its former commissioner, Kevin McAleenan, to build an AI tool that will scan for fentanyl at ports of entry.The new DHS AI pilot programs, however, will rely on large language models rather than image recognition, and will largely be used in the interior of the country rather than at the border. DHS will report on the results of the pilot by the end of the year.",
    "created": 1710778475
  },
  {
    "kind": "article",
    "url": "TEST 12",
    "source": "The Verge",
    "title": "TikTok is paying creators to up its search game",
    "text": "TikTok is leaning in even more to its app being used like a search engine.Creators making money on the platform will now be paid based in part on how well their content meets what other users are searching for. TikTok calls this metric “search value,” and it’s one of four core elements in determining creator payouts. TikTok announced the change as part of its new monetization program, called Creator Rewards.This metric is the TikTok version of search engine optimization (SEO). One tactic in SEO is keyword research, where publishers make content that aligns with what searchers (the vast majority of whom are using Google) are looking up. On TikTok, search value is whether a creator is posting content that is about topics users are searching for in the app. TikTok encourages creators to use a new tool called Creator Search Insights to research trending searches.“With these insights, creators can source inspiration for their content, tailor their creative strategies to meet audience interests, and create content that people want to see more of,” the company said in a blog post.“Succession outfits,” as in what the characters of the HBO mega-hit TV show might wear. Screenshot: Mia Sato / The VergeThe insights tool essentially lays out ideas for videos a creator could make, based on both personalized and general data. On my account, for example, TikTok flagged “Succession outfits” as a recommended topic for me to make content about. Also listed: “Herman Miller Chair,” “Fairy Grunge Room Ideas,” and “strawberry muffins.” Switching over to the more general trending tab and filtering to the “tourism” category, TikTok lists “Grand Oasis Cancun,” “budpest things to do,” and “backpacking essentials,” among other topics. One way to read this is that it’s a case of TikTok incentivizing creators to make videos that satisfy business needs. If I search “best vacuum repair shop nyc” and there aren’t relevant videos that the platform can serve up, that’s a problem for TikTok — I’d probably leave the app and search for that on Google Maps or Yelp. This explicit emphasis on search query-related content also signals that the platform is more seriously thinking of itself as a search engine. An Adobe report from January found that two in five people in the US use TikTok for that purpose, and one in 10 Gen Z users were more likely to use TikTok than Google. Executives at Google have warned that Search could be losing ground to TikTok. Along with search value, the revamped creator monetization program uses originality, play duration, and audience engagement to determine how much creators earn. The program replaced the original $1 billion creator fund with a new focus on videos longer than one minute.",
    "created": 1710777600
  },
  {
    "kind": "article",
    "url": "TEST 13",
    "source": "The Verge",
    "title": "YouTube adds new AI-generated content labeling tool",
    "text": "Today, YouTube announced a way for creators to self-label when their videos contain AI-generated or synthetic material. The checkbox appears in the uploading and posting process, and creators are required to disclose “altered or synthetic” content that seems realistic. That includes things like making a real person say or do something they didn’t; altering footage of real events and places; or showing a “realistic-looking scene” that didn’t actually happen. Some examples YouTube offers are showing a fake tornado moving toward a real town or using deepfake voices to have a real person narrate a video. On the other hand, disclosures won’t be required for things like beauty filters, special effects like background blur, and “clearly unrealistic content” like animation.YouTube’s AI-generated and synthetic content label requires creators to be honest. Image: YouTubeIn November, YouTube detailed its AI-generated content policy, essentially creating two tiers of rules: strict rules that protect music labels and artists and looser guidelines for everyone else. Deepfake music, like Drake singing Ice Spice or rapping a song written by someone else, can be taken down by an artist’s label if they don’t like it. As part of these rules, YouTube said creators would be required to disclose AI-generated material but hadn’t outlined how exactly they would do it until now. And if you’re an average person being deepfaked on YouTube, it could be much harder to get that pulled — you’d have to fill out a privacy request form that the company would review. YouTube didn’t offer much about this process in today’s update, saying it is “continuing to work towards an updated privacy process.” Like other platforms that have introduced AI content labels, the YouTube feature relies on the honor system — creators have to be honest about what’s appearing in their videos. YouTube spokesperson Jack Malon previously told The Verge that the company was “investing in the tools” to detect AI-generated content, though AI detection software is historically highly inaccurate. In its blog post today, YouTube says it may add an AI disclosure to videos even if the uploader hasn’t done so themselves, “especially if the altered or synthetic content has the potential to confuse or mislead people.” More prominent labels will also appear on the video itself for sensitive topics like health, election, and finance.",
    "created": 1710776897
  },
  {
    "kind": "article",
    "url": "TEST 14",
    "source": "The Verge",
    "title": "The M1 MacBook Air is not only still around, it’s cheaper than ever",
    "text": "When Apple stopped selling the M1 MacBook Air last week to make way for the new M3 version, I mourned the loss of the M1 Air’s iconic wedge shape. But perhaps that was a bit premature. Walmart announced Friday that for the first time, you can buy the M1 MacBook Air from its online store (and in-store soon) for a discounted $699. On Friday morning, Best Buy was still charging $999.99 but has since dropped its price to beat Walmart’s deal and is currently offering the same laptop for $649.99.Looking at Walmart and Best Buy’s sites, these are new laptops and not refurbished models, which makes the $699 / $649.99 price compelling. That said, you only get to choose the base model, which comes with 8GB of RAM and 256GB of storage. I’d normally bristle at 8GB of RAM and such a tiny storage setup in 2024, but the price drop takes some of the sting out of that. These prices are even lower than recent discounts that had taken the laptop down to $749. The one thing that’s unclear is how long Apple will continue supplying Walmart (or other retailers) with new M1 Airs or whether this is a short-term arrangement until the existing stock is cleared out. We’ve reached out to Apple for clarification but didn’t immediately receive a response.If this is an ongoing deal, that’s huge for wedge-heads everywhere. And even if it isn’t, at least it gives folks the option of getting one before they’re truly gone. The M1 Air is a beloved laptop, and it warms the heart to see the wedge shape will be around for just a smidge longer.The MacBook Air is Apple’s entry-level laptop, which comes outfitted with the company’s M1 chip in one of three different colors (silver, space gray, and gold). Read our review.Update March 17th, 5PM ET: Updated to note Best Buy has dropped its price for the M1 MacBook Air from $999.99 to $649.99.",
    "created": 1710709211
  },
  {
    "kind": "article",
    "url": "TEST 15",
    "source": "The Verge",
    "title": "A24’s Problemista is a surreal fairy tale about finding the people who truly see you",
    "text": "Each of comedian Julio Torres’ projects has spoken to his ability to tell stories that are shaped by both his distinct imagination and a deep understanding of the hyperspecific idiosyncrasies that make odd people interesting. In SNL sketches like “Wells For Boys,” and his short-lived HBO series Los Espookys, Torres created windows into absurdist worlds meant to seem like places you might only visit in your dreams. But with A24’s Problemista — which he wrote, directed, and stars in — Torres uses his creative powers to paint a picture whose beauty is rooted in how real and emotionally honest it feels.Inspired by Torres’ own experience immigrating to the US, Problemista tells the story of Alejandro, an aspiring toymaker from El Salvador who travels to America in hopes of fulfilling his dreams of working for Hasbro. As the only child born to artist Dolores (Catalina Saavedra), Alejandro grows up experiencing their small pocket of the world as a magical, vibrant place that nourishes his unique imagination. When a young Alejandro (Logan J. Alarcon-Poucel) wishes for a life-size, castle-like playhouse where he can contemplate his feelings, Dolores uses her talents to make his dream real — not just because she can but also because she wants him to understand that he, too, is capable of transforming ideas into reality. Dolores also wants Alejandro to know that she’ll always love him and support his choices, which her dreams tell her will one day lead him to great things. But when the time finally comes for Alejandro to set out on his own, Dolores cannot help but feel like she’s sending him off into a world that isn’t good enough for a soul as sensitive as his.Through both Katie Byron’s impeccably offbeat production design and voiceover narration from Isabella Rossellini, Problemista clues you into how, more than being a simple chronicle of Alejandro’s journey to America, it’s really a kind of fairy tale about a profoundly sensitive and sheltered man discovering what it means to chase one’s passions.Getting to New York City and finding a place to stay are important steps on Alejandro’s path to Hasbro, where he hopes his ideas for social-media-obsessed Cabbage Patch Kids and psychologically manipulative Barbies might land him an entry-level gig. Hopes don’t exactly pay the bills, though. And as an immigrant, Alejandro’s ability to stay in the US is contingent upon finding a job willing to sponsor him before his time runs out. It’s necessity more than anything else that leads to Alejandro working at a cryogenics startup specializing in deep-freezing artists like Bobby (RZA) who want to wake up centuries into the future. But it seems to be fate that introduces Alejandro to Bobby’s ferociously belligerent art critic wife Elizabeth (Tilda Swinton) the very same afternoon he’s fired.While the whimsical atmosphere of playfulness that Problemista leads with never really fades away, it becomes much more unhinged once Elizabeth enters the picture with a proposal for Alejandro to become her newest in a seemingly long line of overworked assistants. In Elizabeth — a living reality distortion field whose fuse is as short as her outfits are loud — Alejando can see a woman in mourning who ultimately wants to be seen and heard more than she actually wants to fight. But shouting is Elizabeth’s default mode, and while most people experience her rageful outbursts as ordinary temper tantrums, Alejandro visualizes them as a series of battles between a bloodthirsty monster and her helpless victims.Though Problemista’s flights of fancy bring a levity to the film, their strength lies in how powerfully they illustrate the more complex, serious ideas Torres is exploring with his script, like the ways in which the US’s visa system makes it extraordinarily difficult for immigrants to build new lives and thrive in the country. Dealing with Elizabeth and her quest to track down a series of Bobby’s egg-focused paintings is its own kind of hell that would make anyone want to dissociate. But it pales in comparison to the anxiety Alejandro lives with knowing that he’s just days away from being deported.Even with sympathetic case workers like Khalil (Laith Nakli) rooting for him, without money, there’s no way for Alejandro to escape from the immigration system’s never-ending fees or the overdraft charges that plague his bank account. And the more time Alejandro spends trying to navigate the unfairly designed maze of near-poverty, the more he finds himself turning to the embodiment of Craigslist (Larry Owen) to find extra low-paying side hustles.Problemista quietly weaves many of its narrative threads together in clever ways — Elizabeth is the cave-dwelling monster who haunts Dolores’ dreams, for example, and the critic’s power to will things into existence (by bullying people) reminds Alejandro of his mother’s knack for translating rough sketches into three-dimensional works of art. But the film sometimes feels more like an ensemble of complementary stories rather than a singular narrative (which isn’t necessarily a knock against) because of how much time the film spends with side characters, pulling the focus away from Alejandro. Together, Swinton and Torres are a storm of delightful eccentricities that belie their characters’ shared yet distinct emotional vulnerabilities. As Alejandro and Elizabeth grow closer, Problemista’s forays into the absurd become even more intense and fantastical to emphasize how they represent the truth of what something is. Those truths are often so terrifying that people don’t want to see them. But Problemista emphasizes how healing it can be to confront them through art and by trying to build meaningful connections with others even when the task seems impossible.Problemista also stars Greta Lee, Spike Einbinder, Kelly McCormack, Megan Stalter, Charlene Incarnate, Martine Gutierrez, and Carlos E. Navedo. The film hits theaters nationwide on March 22nd.",
    "created": 1710686700
  },
  {
    "kind": "article",
    "url": "TEST 16",
    "source": "The Verge",
    "title": "Nidus turns a beautiful ecosystem into a frantic shooter",
    "text": "Scavengers Reign is a beautiful exploration of a complicated, fascinating, sometimes brutal ecology. Nidus is also a beautiful exploration of a complicated, fascinating, sometimes brutal ecology. Their approaches and styles are different, but the underlying themes share a connection — and an artist. Caleb Wood is an animator and now game developer who worked as a concept artist on Max’s sci-fi show while simultaneously solo-developing his recently released arcade bullet hell game.Having begun his animation career 15 years ago, Wood decided that he wanted to figure out game development in 2020. Nidus was meant to be something simple that he could use to teach himself programming. “But because I’m able to produce some pretty good art quality,” he says, “I felt like I had to at least try marketing and see what I could accomplish.”In Nidus, players simultaneously control a flower and a wasp in a symbiotic relationship, as they struggle against all manner of strange insects and critters in their wider ecosystem. Wood draws parallels to the symbiosis in Scavenger’s Reign, where dozens of strange alien creatures live in tenuous, dangerous harmony. In some moments, the humans who crash land there also figure out how to coexist with the nature around them, to varying degrees of success.But he calls these parallels “autonomous” — he says he wasn’t deliberately planning much about them as he worked on each project. “I definitely gravitate towards natural themes and that sort of thing,” he says. “[But] the only thoughts going in my head [for Nidus] were that I wanna use these creatures and bugs and even the background as a canvas for looping animation.”Much of Wood’s professional experience is in creating these looping animations. Nidus specifically draws a lineage from some of his earlier short films, like 2015’s TOTEM. Here, animations build up from intricate details, becoming more complex over time, and it’s easy to see it as another example of both the natural themes and the fluid, repetitive style present in Nidus.During development these kinds of animations became increasingly influential on the game overall. Woods began to create “weaving loops” in specific areas, such as insect shells. “It was a way of putting more and more information into a small piece of animation,” he says. And as these animations became increasingly detailed, he began to realize that overwhelming the player’s attention was ultimately going to become a part of the game’s difficulty.“Because the game was slowly becoming about splitting the players’ ability to focus, I just decided, ‘Okay, what if I lean into that and make everything absolutely overwhelming and hard to look at?’” Wood says. Combined with the neon colors and simultaneous control of two characters, Nidus is frenetic. (Perhaps more frenetic than intended — Wood says that he might not make design choices like the twin controls again, calling it “not super accessible.”)By contrast, Scavengers Reign has a much more stripped-back art style. “It’s like you’re playing with geometric shapes whenever you’re designing,” says Wood of his work on the creature designs. It was “refreshing,” he says, to switch back and forth between the two projects. Both animation for TV and games felt similar in that he was trying to create solutions to restrictions. On Scavengers, Wood would get requests from the show’s co-creator and art director Charles Huettner to fill a certain narrative function. In Nidus, the art would need to fit in with the game. “Whenever I’d work on creature designs for the show, it would clear my mind to go back into the mess of Nidus,” Wood says, and vice versa to get back to the reduced designs of Scavengers Reign.He also says that working on a team for Scavengers meant things were simpler for him personally. “You’re just focusing on your small part that is going to serve a larger purpose,” he says. Working solo, making one design choice also meant dealing with all the knock-on effects. Changing an enemy’s weak spot, for example, isn’t just editing the art, but also everything further down the line of dominos — code, game design, and so on. “That spirals out of control real quick,” says Wood.Wood isn’t sure exactly what’s next, but he would like to keep making games — in a team, if possible. Although he says Nidus was useful to give himself a rounded understanding of all the different parts of game development, he says it would be “amazing” to get a dedicated programmer. But whatever his next project ends up being, given his existing body of work, it’s fair to say there’s a good chance it’ll involve strange creatures and the ways they coexist.",
    "created": 1710684000
  },
  {
    "kind": "article",
    "url": "TEST 17",
    "source": "The Verge",
    "title": "A better way to find stuff to watch",
    "text": "Hi, friends! Welcome to Installer No. 30, your guide to the best and Verge-iest stuff in the world. (If you’re new here, welcome. So psyched you found us, and also you can read all the old editions at the Installer homepage.) This week, I’ve been playing the fun puzzler Close Cities, scrounging up money to buy TikTok, reading the latest in my favorite spy-thriller series, debating becoming a mansion squatter, testing Today for simple tasks, taking notes on this great video about the editing in Oppenheimer, and yelling “SPACE!” while watching the most recent SpaceX launch.I also have for you a new AI productivity tool, a great way to find stuff to watch, some new shows about old events, and a deep dive into the collapse of the Apple Car. Let’s do it.(As always, the best part of Installer is your ideas and tips. What app are you obsessed with right now? What show can you not stop talking about? What game is burning all your controller batteries this week? Tell me everything: installer@theverge.com. And if you know someone else who might enjoy Installer, forward it to them and tell them to subscribe here.)Installer / A weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe.The DropLikewise. I’ve been a fan of Likewise as a show and movie and podcast recommender for a while, and the app just got a redesign I really like. It’s extremely just TikTok, but it kind of works — you just scroll from title to title and trailer to trailer until you find something you like. The Apple Car - A $10 Billion Failure. There’s been a lot of great reporting about what happened to Apple’s car project, and this is a great summary. It also makes a pretty good case that, actually, the things that make Apple Apple are exactly the reasons it was never going to win in the car biz.Turning Point: The Bomb and the Cold War. We all rewatched Oppenheimer this week after its big Oscar win, right? If not, go do that, it’s on Peacock. But if you’re looking for some more, this Netflix series is it: a deep dive into how the Cold War started, and whether it ever actually ended.Proton Mail for desktop. I’m pretty ready to call Proton the best non-Gmail email service on the internet. (Gmail’s not even that great, it’s just… it’s Gmail.) The new Mac and Windows apps include both mail and calendar, and it’s silly they don’t work offline yet, but that’s apparently coming soon.The Dyson 360 Vis Nav. A $1,200 robot vacuum seems silly, in the way that Dyson’s prices always seem silly, but they do seem to be worth it a lot. Early looks at this one seem sort of split on whether it’s worth the price, but its mega power and apparent skill with corners is pretty enticing.Evernote. I never, ever thought I’d mention Evernote here — the app seemed to be on a slow road to nothingness. But under new ownership, it’s kind of on a tear? It got Outlook calendar integration this week, plus some handy new formatting stuff (I love collapsible headers in long notes), and suddenly I’m tempted back to an app I once left for dead.Manhunt. A seven-part miniseries about the epic hunt for Abraham Lincoln’s killer? (Which, fun fact, apparently took place in part in the neighborhood where my wife grew up, but that’s not the point?) I’m here for it. I need to read the book it’s based on, too, which I’m told is terrific. Dola. I have long extolled the virtues of text messaging as a productivity tool. This is a really clever (and surprisingly powerful) version of that: an AI assistant that communicates through text messages, that can set reminders, make calendar events, and more. I’ve been using it for one-off reminders all week, and it works great. Ozone on Bluesky. This is the fediverse stuff that gets me excited: the Bluesky team is open-sourcing its moderation tool, so that anyone can build their own moderation systems and users can use whichever one they want. And it all gets integrated right into Bluesky.Screen shareMichael Fisher goes by many names. Michael Fisher is one of them. But he’s also MrMobile, and Captain2Phones, and — this is my personal nickname for him — The World’s Only Remaining Fan of The Palm Pre. He’s also, as of recently, the co-founder of a nifty new keyboard case for iPhone called Clicks.  Michael and I recently had a long, fun chat about keyboards, which is coming to a Vergecast feed near you very soon. But I also asked him to share his homescreen, because, I mean, there aren’t many people on Earth who have had as many homescreens as he has. I secretly hoped he’d send me 12 screenshots and just say, like, “Sorry, these are all my daily drivers.”Alas, all I got was one. But it’s a fun one. Here’s Michael’s homescreen, plus some info on the apps he uses and why:The phone: Google Pixel Fold. Thirteen years of reviewing smartphones has cursed me with an unquenchable thirst for novelty, so I switch devices constantly even when I don’t need to — but I find the Pixel Fold never gets far from my daily rotation. Turns out a digital Moleskine is quite a comforting thing to carry, at least for tech nerds of a certain age.The wallpaper: I’ll be honest: when Google briefed me on its emoji wallpaper last year, I rolled my eyes. But having a bunch of icons representing your interests splayed out in a pleasing pattern on the screen you see the most? Turns out it’s pretty cool! (Also, I like how it “breathes” when I tap it.)The apps: Phone, Google Voice, NYC Ferry, Instagram, Gmail, Reddit, Todoist, Slack, Food Bazaar.One of the things I adore about large-format foldables is all the space they afford me to just... spread out. So my choice of layout is more notable than my list of apps, which I’ve clustered into five folders for two-tap access whether the phone is open or closed. Alongside those, an anchor row of apps that used to be critical core features... but as I write this, I realize how little I actually use the dialer or Google Voice (my SMS solution since it was called GrandCentral before Google scooped it up). Habit is a helluva drug.Another thing I’ve spent too long doing: letting phones try to guess which apps I might want to use at any given time. That’s the bottom row there, and Google’s done a pretty good job of suggesting, on this Monday midafternoon, a mix of productivity and messaging apps. I generally save my Reddit sessions until after bedtime, and I’ve never used my local grocery store app before sundown, so those are oddballs... but I still appreciate the suggestions that do make sense.I will shout out one app: NYC Ferry, which lets me navigate my fair city by sea instead of subway. If you live in New York City and you don’t use the ferry, I genuinely don’t know what you’re doing. (Bonus: they let local elementary schoolers name all the boats, so you’re whisked to and fro by vessels bearing legends like “Tooth Ferry” and “Lunchbox.” It’s the best.)Finally: I’m big on glanceable info, so I use a trio of widgets to make sure I’m getting useful data the second I open my phone. All three are from Google: Calendar for my schedule, Weather for whether I need an umbrella, and At A Glance to give me reminders about stuff I might have missed on the other two. I also asked Michael to share a few things he’s into right now. Here’s what he said:In preparing for a recent episode of the Living In The Future podcast, I watched the classic science-fiction film Outland. A 1981 Sean Connery playing a federal SPACE MARSHAL! Sent to tame a rough-and-tumble mining colony on one of Jupiter’s moons! Yes, it’s High Noon in space, but that’s the best kind of compliment — and what really puts it over the top is the production design, whose blend of Alien and Star Trek II is the purest form of cassette futurism.Speaking of old stuff: I’ve recently fallen back in love with text adventures, the interactive fiction stories that first opened my eyes to computer gaming. Alter Ego was originally written for the Commodore 64, Apple II, and their contemporaries back in 1986 — and these days it’s playable as an app or in a browser. It allows you to live an entire human life, from birth to death, making choices to dictate your path along the way. Playing through a whole lifetime on my phone was surprisingly fulfilling and even at times profound (even if I died in the dumbest way possible, catching a pitch in a softball game). Finally, out in the real world: I had my first experience at a cat cafe this weekend. If you’re not familiar: this is a cafe you can visit that — yes — is festooned with felines. It was a deeply necessary opportunity for me to get away from the digital world and reconnect with the natural one, and if you have a cat cafe near you, it’s the perfect activity for a rainy Saturday. You just need to be prepared for the overwhelming urge to adopt one — or two! — and by the time you read this, I may well have two fluffy new roommates as a result of my own visit! Don’t say I didn’t warn ya.CrowdsourcedHere’s what the Installer community is into this week. I want to know what you’re into right now as well! Email installer@theverge.com or message +1 (203) 570-8663 with your recommendations for anything and everything, and we’ll feature some of our favorites here every week. “I’m a week late, but I wanted to get a single point on the board for Pandora. The new music page highlights artists that match my tastes, and they still have a stupendous radio feature — hardly surprising considering they popularized it. Also, Pandora has a slight edge by keeping podcasts (a feature I do not use) tucked away out of sight, while Spotify loses points, like some people I know, for never shutting up about Joe Rogan, who clearly peaked in the 90’s on News Radio.” — Will“New Pokémon TCG set coming next week, so prepping for that, as well as playing Pokémon Go, because well… I’m always playing Pokémon Go… always.” — Bobby“One small stuff that completely changed the way I use my lockscreen on iOS… Random photos. When I realized that I can hand pick the photos super easily, apply cool filters and make them change randomly when I touch the screen, it became the best way to revive weekends, holidays or last night’s parties by featuring the five-to-ten best pictures on my lock screen. It’s so much more practical and fun than having to open the Photos app.” — Benoit“​​More and more of my friends have been signing on to BeReal — wonder if any other friend groups are seeing this growth. Also, the app keeps trying to get you to view public profiles and I would like them to stop that.” — Wisdom“The amazing Empty Fasting app that launched this week. One-time fee for a beautifully designed fasting app.” — Esteban“I thought I’d throw in a great ‘audio products’ reviewer, Darko Audio. He has some good info and thoughts at the high end and some nerdy written content on streaming protocols. Personally, I’m a Spotify user since, as you say, it’s everywhere. I do feel pushed ever further away from Spotify with each software update that seems to chip away at what was a near perfect interface.” — David“Bought a used, but excellent condition Pixel 7 Pro. After trade-in, $201. Wife recently got the same-condition iPhone 13. Makes you think about upgrade cycles. Also Zack from JerryRigEverything has left an impression on me regarding recycling tech and parts and whatnot.” – Omar“It’s owl breeding season, and I’m back to watching live streams of nesting European eagle owls. In addition to being cute, the camera quality for bird cams is so much better than it was just a couple years ago. Tristan and Isolde on Cam 3 have a clutch of 4 eggs this year!” — Daniel“Watching Mr. & Mrs. Smith and organizing my notes using the PARA method in Microsoft Loop and Capacities.” — CarterSigning offOver the last two weeks, my 15-month-old son has become a Train Kid. He wants to look at trains, make train noises, yell at the trains outside, walk by the train car outside the library whenever we go past. After months of just, like, watching Wiggles videos on repeat, trains are a terrific new trend. And y’all: if you’re not already into TrainTube, you are missing out. Hours upon hours of beautifully shot videos of awesome-looking trains in beautiful locations. It’s peaceful, it’s surprisingly good background noise for working to, and there is nothing funnier to me than the fact that an hourlong video of trains has 107 million views — and according to the comments, most of them are toddlers. I love the internet.See you next week!",
    "created": 1710676800
  },
  {
    "kind": "article",
    "url": "TEST 18",
    "source": "The Verge",
    "title": "Rivian owners now have access to Tesla Superchargers",
    "text": "Rivian owners will be able to charge their electric trucks and SUVs at Tesla Supercharger stations starting today at 9AM PT / 12 PM ET, the company tells The Verge. The news comes after several Rivian owners noticed a software update allowing Supercharger access over the weekend. Rivian was one of the first automakers to announce plans to adopt Tesla’s North American Charging Standard (NACS) for its future EVs. For current owners, Rivian will send out a Tesla-made adapter free of charge, much like Ford started doing last month. The adapter will allow Rivian owners to connect Tesla’s charging plug into their vehicles’ portThe adapter will allow Rivian owners to connect Tesla’s charging plug into their vehicles’ port. The company’s current lineup of vehicles feature Combined Charging System (CCS) inlets for DC fast charging, but starting in 2025, Rivian said it will manufacture its vehicles with the NACS inlet built natively into the vehicle. The upcoming R2, R3, and R3X vehicles will come with factory-installed NACS inlets. Rivian is sending out one adapter per customer, based on the vehicle’s VIN number. A spokesperson couldn’t confirm whether the adapter would only be free for a limited time, like Ford’s plan to start charging $230 per adapter after July 2024. Rivian owners can find and navigate to Superchargers through their vehicle’s infotainment system, as well as the automaker’s smartphone app. The system allows for Plug and Charge standard, in which charging begins automatically as soon as the vehicle is connected. Payment can also be handled through Rivian’s app, meaning that customers won’t have to download the Tesla app in order to pay for their charging. In a statement, Rivian’s chief software officer, Wassym Bensaid, said the update will give Rivian owners access to over 15,000 new DC fast chargers across the US.  “We firmly believe an open charging ecosystem is a key driver for increased EV adoption, so we worked closely with Tesla to offer a seamless digital experience for Rivian owners, including optimized Plug and Charge, integration into Rivian mobile and in-vehicle navigation apps with trip planner and live charger availability,” Bensaid said. “Combined with our fast-growing Rivian Adventure Network and thousands of existing public DC fast chargers, it’s now easier than ever to head out on an all-electric road trip.”Rivian has said it plans to install hundreds of its own DC fast chargers. The company’s Adventure Network calls for the installation of fast charging stations at 600 locations over the next few years.For years, Tesla Superchargers were exclusive to Tesla vehicle owners. In fact, that was one of Tesla’s main selling points: consistent, exclusive, and abundant EV charging. But eventually, the company started offering access to non-Tesla EVs, first in Europe and then in the US after the Biden administration said it would be a prerequisite to tap into some of the $7.5 billion for EV charging in the Bipartisan Infrastructure Law. Tesla CEO Elon Musk said he never intended the Supercharger network to be a “walled garden.”Tesla’s Supercharger network is widely recognized as superior to many of the third-party EV charging stations, most of which feature CCS plugs and the less utilized CHAdeMO charging standard. The company says it has 55,000 Superchargers worldwide, 15,000 of which are located in the US.Rivian says that its customers can access most version 3 (V3) Tesla Superchargers using the adapter, while some older V2 Superchargers won’t be available to Rivian owners.",
    "created": 1710776719
  },
  {
    "kind": "article",
    "url": "TEST 19",
    "source": "The Verge",
    "title": "Here’s the Elon Musk interview that got Don Lemon’s show canceled",
    "text": "Don Lemon has published the “tense” interview with Elon Musk that got his show canceled on X. During the interview, Lemon touches on various topics related to hate speech on X and Musk’s own views on right-wing conspiracy theories, with the billionaire becoming noticeably irritated by the interview’s end.Things start to take a turn about halfway into the interview. Lemon asks Musk about his comments on illegal immigration and the far-right “great replacement theory” and then turns to the topic of content moderation. Lemon asks whether better content moderation on X would let Musk avoid some of the criticism of his posts about the great replacement theory.“I don’t have to answer questions from reporters,” Musk responds. “Don, the only reason I’m doing this interview is because you’re on the X platform, and you asked for it. Otherwise, we’re not going to be doing this interview.” Musk adds that he doesn’t “think people should care what the media thinks about them.”Lemon and Musk go on to argue about the presence of hate speech on X. Lemon points out a study that found antisemitic posts on X grew from June 2022 to February 2023. Musk responds by saying that studies only “count the number of posts but not count the number of views.”Lemon then suggests X should take these posts down because “they’re hateful” and “can lead to violence.” Musk responds that Lemon “loves censorship” and that X will only remove content that’s illegal. “You can sign up right now and do 100 things that are hateful, but if nobody reads it, it doesn’t matter,” Musk concludes.The interview also goes over Musk’s disagreement with companies’ diversity, equity, and inclusion (DEI) policies as well as his views on racism. Musk says the country should “move on” from a history of racism and that “we are all descended from slaves.” (“Well not everyone was a slave,” Lemon responds.)Lemon later says he has personally experienced discrimination and that it’s “insulting” for “someone to say that that hasn’t happened and I should just move forward and ignore the past.” Musk replies by saying Lemon keeps “putting words” in his mouth and that “we should treat people like individuals and base our opinions on them on their character.”Things get more heated at the very end of the interview, when Lemon mentions Musk’s statement that advertisers could “kill” X with an ad boycott. Lemon asks whether Musk should take responsibility if X fails. “Doesn’t the buck stop with you?” Lemon asks. Musk replies by telling Lemon to “choose your question carefully, there’s five minutes left.” As Lemon attempts to dive deeper into Musk’s upbringing, Musk says there are only a “couple minutes” left and that he has a “whole roomful of people waiting to meet with me.”There are other parts of the interview worth watching as well, including Musk talking about meeting with Donald Trump and Musk’s prescription ketamine usage. Musk says he uses ketamine, which is a dissociative anesthetic, once in a while when he gets into a “negative sort of chemical mindset.” He also says he met with Trump but denied rumors that the former president asked for a donation for his political campaign.Lemon, a former host on CNN, was supposed to debut new episodes of his show on X as part of a deal he struck with the platform earlier this year. However, Lemon said Musk decided to cancel the deal after their interview, which Musk later confirmed, saying Lemon’s show is too similar to CNN. Lemon’s show will still be posted on X, but it just won’t appear there first.",
    "created": 1710774299
  },
  {
    "kind": "article",
    "url": "TEST 20",
    "source": "The Verge",
    "title": "Why Figma CEO Dylan Field is optimistic about AI and the future of design",
    "text": "We’ve got a fun Decoder today. I talked to Figma CEO Dylan Field in front of a live audience at South by Southwest in Austin, Texas, and we got into it: we talked about everything from design, to software distribution, to the future of the web, and of course, AI. Figma is a fascinating company; the Figma design tool is used by designers at basically every company you can think of. And importantly, it runs on the web — it’s really easy to share Figma designs with other people and work on them together. That sounds obvious now, but it was a revolution in design when Figma launched in 2016, and it quickly grew into a serious player in the creative software world. So much so that Adobe tried to buy it out in 2022 for $20 billion, a deal that only just recently fell through because of regulatory concerns. Listen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!So Dylan and I talked a lot about where Figma is now as an independent company. About 4 percent of Figma’s employees took a buyout offer after the deal fell through, so of course, we talked about how Figma is structured, where it’s going, and how Dylan’s decision-making has changed since the last time he was on the show in 2022.Beyond Adobe, the two big topics I wanted to talk to Dylan about were AI and the web. Like every big software company, Figma is investing heavily in AI. But it’s also in the unique position of serving the creative community — a community that has strong opinions on whether new generative software tools are taking jobs while also creating a deluge of low-quality work. You’ll hear Dylan make the bull case for generative AI. He argues that more empowering software should increase the demand for human creativity and let more people in, and let those people work better and faster. He’s optimistic that even in a world of C-plus AI-generated content, both creators and consumers will push great stuff to the top. This topic dovetailed nicely with another we dug into: the state of the web. Even though the web is under a lot of pressure right now due to AI and the dominance of big platforms, Dylan is still a believer in its potential. After all, Figma is a web app, and Dylan and I discussed how he’s looking at the landscape of software distribution in 2024, especially as European regulation like the Digital Markets Act has taken aim at app stores and mobile browser restrictions to try to create a more level playing field for developers. We also talked about design trends, which is always a good time — get ready for something called solarpunk to take hold.Okay, Figma CEO Dylan Field. Here we go.This transcript has been lightly edited for length and clarity. Dylan Field, you are the co-founder and CEO of Figma. Welcome to Decoder. Welcome to South by Southwest.Thank you.I am very excited to talk to you. Figma is at the center of many, many, many big stories in tech right now, from design to building on the web to antitrust law. You name it, that’s you. So I just want to start with a very big question: where’s your focus these days?I think that the way a lot of people think about Figma is as a design tool. And obviously that is where we started and where we continue to put a lot of work into making that better. But how we think about Figma has really evolved from just how do we make the best tool for software design to really supporting the entire process of how you build software. Everything from starting with an idea or brainstorming or figuring out where your team is at, getting all the way to code and production.And we have three products that we offer: FigJam for whiteboarding and brainstorming, Figma Design for software design, and now we just launched in [general availability] about a month ago, Dev Mode, which helps developers translate those designs into code. And we, I think, have so much more opportunity to figure out how do we actually make it so that you have the most efficient but also best way to explore and bring more people into the process, going all the way from idea all the way to app or website or reality.So that last turn is really interesting, that we’re going to look at a design we made collaboratively and actually turn that into production code. The last time you were on Decoder, you were at the beginning stages of thinking about that, now you’ve actually shipped it. In the meantime, there have been what I might call some distractions. How have you managed to stay focused on shipping ideas that big?Yeah, so I think what you’re referencing as a distraction is — which I think actually in some ways created focus, but we can talk about that — was we tried to merge with Adobe, and various world governments didn’t see the same way we did. And so we’re back to being an independent company again. I guess we never stopped being independent. While it was certainly distracting to have our exec team spending a lot of time going back and forth to Europe and London and talk with regulators, I think we also tried to make sure that the team was as isolated from that as possible. And we knew what our road map was, we knew what our goals were, and we tried to just have absolute clarity about that. And what ended up happening was, as a result, I think we actually picked up our pace during this deal review period. Now we’re picking it up even more, and I think we’ve been accelerating through all that, but it’s been interesting and definitely we’ve had to push hard to make that happen.Let’s talk about Adobe just for a few minutes. It’s been several months. The deal was called off in December. We’re obviously sitting here in March. Time has passed. I had the general counsel of Adobe on Decoder a few months ago, it was like the week the deal was called off. He wanted to talk about AI and copyright law, and I was like, “No, let’s avoid that bomb and talk about this deal being called off.” And he said, “Look, we understood that the regulators are not going to let us go through and we made a decision.” That’s his side of it. Talk about that moment for you when you knew that it wasn’t going to go forward.There’s kind of like the Twitter meme of, “We’re so back, it’s so over,” and you kind of had those cycles through the deal process. And maybe the general trend was toward, as you saw, more thinking from the regulators over time, it was more clear that this had a less probability. But even toward the final months, there were these moments of, “Oh, this is going to go through,” and moments of, “Fuck, what are we doing?” And obviously at the end, there’s a mutual understanding of, “This decision has been made for us and let’s call it.”But look, you’re only allowed to have so much coordination / collaboration and learning from the other sides in these deal processes legally, and you know all about that. But for me, I actually really enjoyed my time that I got with the Adobe team, especially [Adobe CEO] Shantanu Narayen. He’s, I think, pretty legendary and that was probably one of the things I was most bummed about is not having him as a mentor, but now it’s full steam ahead. Let’s go figure this out and be the best independent company we possibly can.So the theory of the case from the Europeans was that Figma should be a meaningful competitor to Adobe. It is not yet, but it will grow into that. [Adobe executive VP] Dana Rao, I think he was skeptical of this claim. He’s like, “I have 800 people, we’re Adobe.” You have to make Photoshop. That’ll be very hard for you. Do you think Figma can now become a meaningful competitor to Adobe?I mean that’s just not where we’re headed right now. Like I said, we’re really focused on the software process. How do we make it so that people go from idea all the way to app or website? There’s a certain amount of building, some amount of buying, some amount of partnership that’s going to go into that. We’ve got to figure out exactly how that all will work. But yeah, it’s a very different market and very different process than Adobe’s in. I think it’s interesting if you think about the future that way of what’s possible. Regulators were kind of telling us you can do anything, anything’s possible. And it’s like you kind of want to believe that because I really think our team is great, but at the same time it’s like, “Well, here’s our priorities, here’s our road map, here’s our focus. It’s all documented.” And it’s a weird conversation to try to disprove that you can do anything. But ultimately, that’s sort of the way that regulators think, and it’s flattering, I guess, in some ways.I think telling a charming European bureaucrat that I can’t actually do anything must be very difficult.Well, the reality is it’s all just tradeoffs, right?How much time? What do you think the opportunity is? We have these very adjacent opportunities that we’re going after because a third of our users, for example, are developers and we know from our research that, pre-Dev Mode, we were not doing the best we could for that audience. And even now, we know that there’s so much opportunity ahead to make the experience of being a developer in Figma better. That is a near-term opportunity that there’s so much we can do quickly on. We try to go build Photoshop, that’s going to take a very, very long time. What exactly is the income or revenue? You have to work through that.Let’s talk about that opportunity. I want to talk about what you see ahead, but let me ask what I think of as the Decoder questions so we can... This is the brand. All of you’re supposed to cheer when I say the Decoder questions. [Cheers]. There we go. I feel very proud that I branded some LinkedIn bait. Thank you for indulging me. About 4 percent of your folks took a buyout after the deal fell through, right? They were kind of waiting on this to be the big moment. It didn’t happen. How many people is Figma now?We’re about 1,400, which I think is actually the same size as you guys. What you’re referring to I think from the buyout term, we had this program we ran, we called it Detach, which is a Figma pun. We said, “Okay, look, if you’ve been at Figma for a long time, you’re tired. Or maybe you joined and you thought you were joining Adobe, but surprise, you’re at a hard-charging startup. If you want to get off the train, that’s okay. Here’s three months of pay and you’re still in good standing with the company. We’re still friends. If you want to reapply in six months, that’s fine.” And about, like you said, 4 percent or so of people took it, and I think it’s really positive. Now everyone that’s here is committed and we have a lot to do, so that’s sort of the momentum I wanted.How are you structured now? How’s Figma structured?We have engineering led by our CTO Kris [Rasmussen]. It’s the largest part of our organization. Product led by our chief product officer, Yuhki [Yamashita], product design research. We have go-to-market, our CMO Sheila [Joglekar Vashee] who recently joined, is leading, which includes not just marketing but also all things support. And we try to really connect the customer experience there. Sales, which has been ramping up quite a bit. Our CRO, Shaunt [Voskanian], is running that org. We also have biz ops, which includes finance and accounting as well as various business functions, led by our CFO Praveer [Melwani]. And we also have people, which is led by our chief people officer Nadia [Singer].Now, this all reports to you?This all reports to me, and it’s very functional.And as people have come and go, people have detached, have you had to change that structure at all?No, there’s no changes.And then as you think about growing and expanding, I know you took a billion-dollar breakup fee from Adobe, which is the greatest breakup of all time. More people should exchange cash when relationships end. I would’ve actually lost money on that deal, I think, over time. But you have a billion dollars from Adobe. I think you told my colleague Alex Heath you might acquire some things with that money, do you think you’d have to restructure as you acquire or you think you could plug right in?I think it depends on what you acquire and how that goes. But yeah, after obviously fees, taxes, we definitely are excited to pursue strategic acquisitions. I think that there’s a lot we could do there, but also just a lot we can do in partnerships, too, and a lot we can build. And so I’m excited to keep Figma as an efficient business. We’re very efficient right now and I’m proud of that, but also make it so that as we continue to grow, we’re able to bring in new perspectives to the company.You could acquire things — there are indie versions of Photoshop in the world. There are other creative tools or markets where Adobe is winning or losing. Would you acquire stuff that puts you in direct competition with Adobe?I mean, it’s not what we’re looking at right now. I can say that.I know a lot of designers who want the indie Death Star. I don’t want to name the apps. So it’s like Pixelmator, all these indie apps that people use that aren’t Creative Cloud, you would never roll those up? I mean, look, “never” is a long time, but I can say that those are not conversations we’re having right now.Makes sense. Last Decoder question, how do you make decisions? You’ve come a long way. When you started as a CEO, you were pretty open that you were learning on the job how to do this. So you’ve come a long way, you’ve fended off or not fended off some charming European bureaucrats. How do you make decisions now? How have you evolved?I think that every decision is different, and I like to think of myself not as someone who just sticks to one framework, but rather that I have a kind of collection of frameworks. And I think that, even for a single decision, you don’t just want to make it with one framework in mind, but you want to have multiple frameworks and almost do a meta framework approach and then think about it from these different points of view. For example, the way that the company makes decisions maybe is more interesting to talk about. I think we are a good mix of top-down and bottoms-up. What I mean by that is there’s a lot that the team just drives and I don’t see, and that just keeps going. There’s also a lot that I push on, and my leadership team and I debate vigorously, and then we have an opinion and we say, “Okay, we’ve got to march in this direction.”So one example of the bottoms-up empowerment side is something we launched this past week called Multi-edit. I don’t know how many Figma users are in the room.Multi-edit rules, by the way.Thank you.It’s very cool. And there are very few companies, I think, that are like, “What is a selection box?” And it’s like this very basic thing. I think it’s very cool. Talk about that.Thank you. Yeah, so that’s one where, honestly, it took years to develop. And it’s the sort of thing where it exists now and you’re like, “Yeah, of course it works that way.” One weekend into launching, our users have already forgotten, I think, the old way it was because the reality is it almost feels like a discovery. It’s, I think, just clearly the way that it should have always worked. And the reality is it takes so long to figure out these very simple discoveries. And what was cool about the process for Multi-edit was it started with individuals in the company that showed this off and said, “Hey, I think this could be really powerful.” And then over time, we got to maybe 80 percent of what it should be, but there was maybe 20 percent that was really hard to figure out still. And we shelved it for a while because we were like, “We have other things we’ve got to work on. This seems really tough. It’s kind of a research-y problem.”And then we came back to it over time, shelved it again, came back to it again, and over three years, various people worked on this project until it eventually got to completion. And I was seeing what the team was coming up with and saying, “Okay, this is high enough craft, this is high enough quality or not,” but I was less pushy on that one. It was more really coming from the team, and I’m really proud of the team for delivering something that I think is going to be seen as one of our most fundamental releases looking back 10 years from now in terms of how we actually fundamentally moved the paradigm of UI design forward, even though it’s a simple thing. Maybe a different example of top-down would be Dev Mode. This is something where we said, “Okay, we’ve got to figure this out. A third of our users are developers. We’re doing the research, we’re looking at NPS. They are not as happy in Figma as designers are. How do we make this experience better for them?” So the first thing we did is we acknowledged that we didn’t necessarily have the right expertise in the team, and we actually went out and acquired a company called Visly. And then we went and really iterated with them, built out the team more, brought more people in. And over the course of, again, years — I mean both of these projects took a lot of grit — but we were doing weekly or bi-weekly syncs, then sometimes many times a week syncs as we got to the product that is now Dev Mode. And that was a very top-down driven initiative of we have this direction, we need to go in this direction, we need to figure this out. And I think as a result, probably got a lot more consistent attention, but it was sort of a different process.Let me ask you about a distinction between those two. I think it’s interesting and challenging for a lot of people who make things. Multi-edit is very cool. Everyone should go look at just the GIF of how Multi-edit works. It’s very cool. That is a bunch of people thinking about, “Man, I wish my computer worked better,” which is in a very fundamental way. “I wish I could pick four things on a screen and apply the same edit to all of them, and right now I can’t do that. And I just want my computer to work better.” Dev Mode is, “Boy, we’ve got a whole chunk of our users, we could get more users and make more money if we can build this tool and...”And, most importantly, add more value.Sure. So that they’ll pay you more money. But it’s fine. I’m a capitalist. I run a business show, don’t worry, it’s all fine. But they’re different ways of thinking. From the way you’re describing it, they require the same amount of tenacity, they require the same amount of focus. How do you hold onto the focus of the thing that’s just like, “We want to make this core feature more interesting” versus “We’re a startup, we’ve got to grow, we want to grow our market over here,” which everyone seems to understand? I think that it’s all about empowering individuals and making a culture where people that are really innovative thrive and they have a path to pushing ideas forward. One thing we do is we have Maker Weeks, where we basically have the entire company for a week. We give them permission to say you can do whatever you want as long as it’s benefiting Figma in some way. And some people are like, “Cool, I can work through my inbox.” Other people go and — this a majority of them — fundamentally reinvent process or come up with ideas like Multi-edit. Then it’s about, “Okay, how do you recognize which of those ideas have longevity and we should keep putting more resources into?” And also, how do you make sure that the people that are those starters that have the tenacity, the grit, but also the creativity to come up with new ideas like this, that they’re still excited to just stay as the company grows and that you are creating room for them to be creative?One of our values is play, and I think that it’s really important to lean on that. There’s periods where you don’t, where it’s very gritty and we have to really be just hunkered down. It’s like we’ve got to road map, let’s execute, and there’s periods of more exploration. AI is an interesting example where we had an AI hackathon, and it was just two days. We said, “Okay, let’s see what comes out of this,” and there were a bunch of ideas that people presented. A few of those were ones we doubled down on. So one of those was something called Jambot, which is, in FigJam, you can have this widget that lets you explore and do basically GPT queries in a nonlinear way. So we all have experience, we know of ChatGPT, where you basically are having this very linear conversation. Well, what if you could make that actually branching and try to basically explore that in a way that’s nonlinear? And people really enjoyed that and continue to enjoy it.We also have what became basically this prompt to a FigJam template that came out of that initial AI hackathon. Basically, we see a lot of people that use FigJam not just for diagramming but also for whiteboarding, but in the context of a meeting and making a meeting just fundamentally run better. And if you look at the way that Figma uses FigJam, if you tour our office, for example, you’ll see FigJam up on all these screens. Sometimes these people are all in the same room, sometimes they’re hybrid or all remote. It literally works across all those modalities. But it’s really neat how, if you set up FigJam the correct way, it can really help get more people to contribute their ideas and also it can help you converge as well. So it really maps design thinking in that way. But there’s that requirement of you’ve got to set it up right, and that takes a while. So how do we help people do that? And that’s what prompt-to-template created.And we’ve seen people that use prompt-to-template — this AI feature for FigJam — they use FigJam a lot more and they’re more successful in their meetings. And I think that’s something that also wouldn’t have come up as quickly if it wasn’t for this more grounds-up innovation culture we have.You’ve predicted my cards very well. Well done. My next questions are all about AI.Glad to help.Thank you. I need all the help I can get. I understand how AI helps enterprise tools like FigJam, right? I understand how it helps engineers write code better. I understand how “I don’t want to write emails, I’m just going to let the robot write my email.” I get it; do it. Figma is a tool for creatives, and creatives, I think, have a much more charged relationship with the concept of AI. How do you see it? How do you feel about that right now? You’ve got a big audience, a market of creatives who are, I would say, most charitably of two minds about AI, especially generative AI. How do you see it?Well, the way we’ve talked about it internally is that AI has this opportunity of lowering the floor but raising the ceiling. So it could enable us to get more people into the design process, but also it should make designers way more efficient. You should come to Config this year. It’s in June, all of you should. I think when we are at Config, you’ll see a bunch of stuff that kind of points to both those directions: ways to get people more involved, even if they’re people that are not comfortable typically with putting components on a screen or drawing in Figma Design, and you’ll also see ways that designers are able to get a lot more time back, be more efficient. And to your question about how will designers navigate this and how will they react, my point of view is that AI will help people navigate abstraction boundaries.So, for example, we have brainstorming with whiteboarding in FigJam, we have Figma Design, we have Dev Mode. How do you cross those abstraction boundaries with AI? I think that will become something that’s really interesting. I also think that if you think about the design process and just building software in general, we’re all navigating this idea maze, and the idea maze has all these branching possibilities. AI, if you are extremely generous, let’s say that we get to the world — in three to five years or whatever — where we have AGI. Let’s just take that sort of bull case for AI.Three to five years?No, I’m not saying that’s my prediction.Okay.I’m just saying let’s say that you have some AGI sort of thing in three to five years [or] 2030, seven years. Let’s say it makes decisions right 95 percent of the time. It sounds kind of scary. But then if you actually think about it, if you’re going across that branching path of decisions and you have all these different steps along the way where you have to make a call, if you take the compounding effect of 95 percent right, you get to 1 percent chance over a long series of decisions that you get a good result. And so my point of view is that even in this kind of world, you have so much context that a designer has about all the past screens and affordances they’ve ever seen, the emotional context the user’s in, the cultural context of what’s going on, the business strategy, the business goals, and more. Even just the temporal aspect of how do you have people navigating this application and software?And maybe you could write that all into some 30-page brief, but at that point, even if you do, it still might make the wrong calls if you were just to say, “Here’s my brief. AI, go create designs and software.” I think there’s got to be a human in the loop. And so I think what ends up happening and what we have a chance to facilitate is making it so that you get to that first draft of something faster and you can explore the possibility space of what can happen faster. And that should be a way for designers to have even more superpowers and actually give them even more power in the organization.Alright, let me offer you the exact flip side of what you said.Okay.Which is, right now, every open input box in the field is being flooded by AI garbage. We just see it everywhere. My favorite example of a choke point on this is Amazon reduced the number of books you can self-publish in a day from 5,000 to 200. And it’s like, I don’t think that was going to fix it, guys.So why did they do that?Because they saw this flood of AI-generated books that are being put onto their platform. And that’s just one example. Wix, who has been on Decoder, they just released a full generative AI website builder. You type a prompt, this thing ships a website for you. On the one hand it’s very cool, there’s something very cool about that. On the other hand, it’s terrifying because the web is going to get even more polluted and that’s what you’re competing with. Your vision of the future is you will not want to make all these compounding errors, you’re going to want to make a great product, and the competing vision of the future is, what if we make even more garbage and make it harder to find the good stuff? How do you navigate that?Well, first of all, I think the people that use Wix are not the people that use Figma.Shots fired.I’m just being honest, right? I don’t see them as a competitor actually.Okay.Anyway, we can talk about that another time, but the...No, keep talking about that.So if I take a step back for a second, the fundamental bet that I now understand we were making when we started Figma was that more software is going to be created in the world over time. And that’s definitely been true. We started Figma [in] August 2012. It’s just wild to see even, over the past decade, how that curve has gone in terms of software in the world. And I think that the interesting thing is that we almost all just kind of forget that that’s happening. It’s just kind of taking it for granted: “Oh yeah, of course software is important.” It’s in the air that we breathe now. But from my vantage point, what I’m seeing with Figma, we’re still very much in the exponential curve of more software.And I think that with AI, whether it’s Wix making a website that’s generated that way or it’s us helping people create more designs or many other effects that will happen, I think there’s going to be even more software that will be created. And I believe that design will be the way that you differentiate that software and make it something that people want to use and your business wins. Or if you’re not strong enough in design, that’s why you might lose. And I think the digital experience is hugely important today, and I think it’s everything tomorrow.I think you’re getting right at the tension. A bunch of creatives in this audience listening to Decoder, whenever we write about an AI tool, we get a flood of angry people who are like, “That’s not good enough and it’s actually built on our work, it’s trained on our work without us capturing any value back.” And the overall desire of the audience to have good stuff will go down because they will live in a world of C-plus work. And I’m just curious, people use Figma — Dev Mode for example — you’re inching closer to type in a prompt and Figma and get all the way to a shipping app. You can see how the next four turns of Dev Mode get you there. Are you worried that you’ll contribute to the sludge problem?I think that even if there is more content and more design and more software, that just creates more demand for more great software. And so, I actually think that in a world where you’re able to navigate this idea maze faster, you’re able to point in different directions. First of all, you still need to refine. You still need a human loop the entire way you go through that for the best software. But also I think that there’ll be more opportunity and more demand for design in order to make it so that you’re able to navigate how do we create the best experience? Because if you’re right and there’s way more C-plus content, of course you’re going to want to rise above that if you’re trying to make the best thing and attract the most people to your digital experience, whatever that might be.Yeah. One of the things I think...Does that make sense?It does. I think you are more optimistic about it because you sell software and I write about software, and I think that’s a natural tension that we can be okay with. The thing I think...I think what we’re both saying is there’ll be more stuff put out, and that, to me, implies that there’ll actually be more need for more people to work through that. And I think maybe where we disagree is you’re saying that just like there’s going to be people that say, “Okay, write this book in a thousand ways. And AI, go.” And I’m saying, actually, what will be needed for a business to succeed in this environment will be more people working in collaboration with AI and AI agents over time and making sure that you create the highest-quality results.I don’t disagree with that, broadly. I think what I am worried about and consistently worried about is that having the best thing win implies that people can find the best thing. And when you are in the sea of garbage, and our internet right now is like a sea of garbage...With a lot of gems.But it’s getting increasingly harder to find them, right? And the ways for me, an app maker, [or] you, a software maker or someone else, an author, to go find a real audience that’s going to value them more than 50 AI-generated ripoffs of that that are free on some platform that is designed to make you download Temu or whatever — it’s the internet we’re in. That’s going to be too hard. And that’s the thing I worry about. I want great design to succeed, I want great apps to succeed. Every day, I see that it’s getting harder and harder to build that business than the “Here’s some garbage” business.It’s interesting because you look back at the history of the web, and I feel like people have predicted the web’s demise so many times. When I was a kid, I grew up using AOL and even then, I was reading people saying in the tech section of the newspaper… Because in the 2000s era, there was a tech section; that was really nice. It went away one year.You’re saying you don’t like The New York Times tech section?No, I meant there’s a full section in the newspaper every day. Anyway, people were saying AOL is going to kill the internet. And in reality, I think it opened up a lot of people to want to explore the internet. And then I was a teenager and people were like, “Oh, Facebook, it’s going to kill the internet.” And I think the same thing happened. A lot of people onboarded the internet through Facebook. And I think that there’s a lot of ways you could say that the web is going to die today. People might say, “Oh, well, you’re going to just interact through a prompt or you’re going to be lost in the sea of garbage.” There’s always a distribution challenge, and the platforms are all trying to figure out how to navigate that. But ultimately, there’s always going to be ways to find the gems to go explore, and that’s the beauty of the web. And that’s why I’m optimistic about the web and excited about the future of the web.Are you sure you didn’t see these beforehand? Because you’re right on the next one, which is the web.I asked you if I could see them before, and you said no.I refused. I gave him one question to think about, which we’ll get to later, which is a fun one. Figma is a web app. That’s a remarkable thing to say in 2024. We run a website. I keep joking that we run the last website on Earth. I think there is a view of the web, particularly in mobile, the web will be a document viewer and the application model will be inside the App Store. And we’ll have the full horsepower of the phone, we’ll be able to manage battery life. You bet on the web, you bet on some key enabling web technologies from the beginning like WebGL, WebAssembly, all these things. Do you still see the web as the best application platform?Oh, that’s a good question. I think for desktop computers, for sure. I think on mobile, you’re more limited. It’s very good in some ways and in other ways, we need improvements still. I think that in a world where Google and Apple really invest in the web via mobile, that’ll be a very good world, and I’m excited for them to just engage more with the developer community over time.Are you feeling like a real love / hate with Europe right now? Because the DMA in Europe is going to make Apple have to support alternative web browsers on the phone. They’re going to put a horrible choice screen in front of people, but they’re supposed to support alternative web browsers on the phone. The idea that the mobile phones will have richer browser innovation, I wouldn’t say it’s real, it’s potentially real. Do you see that as something that’s exciting?Well, I think we’d be a beneficiary of that probably.Yeah? What would you need from that process to be a beneficiary of it?There’s fundamental limits that we can’t necessarily influence as much, and if you have alternatives, then I think that there’s probably more you can push on for other parties in order to get...This is very careful. Be 10 percent less careful in this answer. What do you mean by “there are limits and certain changes”? Like for example, I’ll be very specific, Figma Mirror is a way to mirror designs on mobile. And we still rely a lot on the web for that process, and there are fundamental memory limits. Sometimes that app crashes for us, and that creates a lot of work for us to make it really efficient and make sure that we’re not filing those limits. But there’s also things that are sort of like spooky action and distance problems where you really need collaboration with browser vendors and operating systems in order to fix them and figure out what’s going on. And you can poke around and figure it out over time, but more open source, more transparency will help us achieve better outcomes there probably.You said just a second ago, the web is the best way to ship applications on desktop. I think we see this everywhere. Every new exciting app ships as a mobile app and then as a web app, and there’s very little native Mac or PC software, in the productivity space at least. Why is that? Is that, you don’t want to fight their app stores, you don’t want to deal with their weird binary ideas? Is it just the web is easier and you can just get everywhere?I think that the power of a link is so understated and misunderstood still. It’s amazing to have an atomic unit like that that you can share, and I think that the web default enables collaboration through the cloud and that’s the other shift that we’re seeing across basically all software.And so, you think that some of these changes that are coming to mobile might bring that to the phone... Because you just don’t see that on the phone. The idea of shipping a great phone web app, I think, has hit a stasis point. Like, this is as good as it gets and everyone kind of pushes you to mobile. Could you see some changes that bring out great phone web apps?I think that we’re confounding a few things in this question. You don’t have to predict that people navigate to applications through a web browser versus through apps to believe that apps will get better because of just more technology options available on different platforms. Does that make sense?It does, but I think that somewhere in there are two giant companies who would prefer that their phone platforms get monetized through in-app purchases and mobile apps and limit the power of the web. And so I’m wondering if you see anything that overcomes that beyond the DMA or whatever other regulation, if you see user behavior or technology shifts that might actually disrupt that.Yeah, I see what you mean. I think that it’s interesting. Like right now, if I go buy a book on my iPhone for Kindle, I have to go through this weird browser experience. And yeah, it’d be nice to just buy it and I don’t have to log into Amazon through the browser again. But that’s pretty light friction right now. And I think that as you open up a platform, still a lot of people will choose those default payment options because they’re a great user experience, because they’re just easy to implement. And yeah, you’ll have other people that choose other options and they might not be as good of a user experience. But, at the end of the day, I think it’s more both than one. Where I think about it more from, again, is how do you make the best user experience and what technology can enable that?Let me ask you in a much simpler way. When I was growing up, all designers used Macs. It was like the computer of choice and that company was aligned with Macs. Now all the designers I know use Figma, and a lot of them use Figma on Chromebooks because you have abstracted the actual thing away and the product lives in the cloud. That right now, structurally, cannot happen to the phone. You have to be bought into one application model on the phone. Figma, I think, is a shining example of that abstraction on the desktop. Is there something happening you see right now that can make that happen to the phone where Figma could ship a bigger and better web app on the phone?I see your point in terms of where it could go, and I also think it’s exciting that we’re starting to see more hardware platforms, software platforms come out for mobile.Are you going to get a Rabbit R1 with Figma on it that’s like, “Make a website”?What I will say is I’m pretty excited about just the fact that there’s people building that kind of stuff. I don’t necessarily think that that’s the vision of the future that I think is going to happen, but it’s just cool to see more innovation, more people trying. That’s unique, and we haven’t seen that for a while. But yeah, I think there’s something to that exploration. I’m the guy in the MMO that goes and tries to explore the entire open world, and I sometimes ignore the quests. Modality should be in sometimes where you’re trying to achieve and you’re trying to get an answer really quickly, or order on your DoorDash. I think the demo is like he orders a pizza, it knows exactly what he wants and does it for him. And there’s a mode where you’re like, “Okay, I’m in Austin for South by, let me see all the different options,” or “Actually, I want to go read all the different analyses on this topic.” I think that both exist.Alright. I’m going to ask you a couple design questions and we’re going to open up for questions. You’re a design nerd. I think coming into South by, the biggest design story I’ve seen floating around is the Rivian R3. There was a Cybertruck parked in front of this hotel yesterday that drew a crowd. Those represent, I think, different poles of design, charitably different poles. One, for example, is a triangle and the other one is not. So it goes. But they have a different feel. And we were talking about this backstage.Yeah, exactly.That you think there’s a shift in design coming and the R3 kind of represents that.I think that a lot of things in trends in design are sometimes reactions to what was happening before. I think that we were really futurist, really cyberpunk for a while. We were talking about it, like a lot of neon lines, a lot of hard edges, a lot of poly or low-poly sort of metaphors. And it feels like we’re going more humanist. It feels like we’re going maybe more solarpunk.Solarpunk?Yeah.Alright.I think solarpunk’s pretty cool. It’s more of this optimistic vision of the future, and I like the idea of that, whether that’s what is happening or not. Maybe I’m a little bit projecting my own wishes and desires for what I want to see, but yeah, I’m hopeful.Where are some of the places you see the solarpunk trend?It’s a good question.And solarpunk is in opposition to cyberpunk?Yeah, I think they’re two poles of the same thing, but cyberpunk is dystopia, everything’s metal and concrete and low poly. It’s kind of depressing, but it’s also got that edge to it. Whereas solarpunk is more natural, the architecture is blending with the environment. I think it’s still a vision of the future, it’s still futuristic, but also it’s more human and it’s got a lot of curves, it’s got a lot of... It’s sort of modern, but it’s modern in a sense of it’s blended into the environment more rather than trying to stand out as a piece of technology or a piece of architecture. And yeah, I think we’re going more in that direction.Do you think Figma, just as a tool, as a design tool… When you see your customers use it, do you think, “Okay, we’ve got to lean into letting people make that more or less,” or is it just a blank canvas?Well, it’s interesting because at the start of Figma, the metaphor we had before we even shipped was we are the concrete floor and the user’s content is like the nice rug. And we went super brutalist in our design direction. In the earliest days of Figma, I remember showing designers the tool, and the reaction that we got almost universally was, “Really cool idea, I just am not sure I trust it.” And I was really worried because I thought maybe that this was some reaction to the web and we had made a fundamentally bad platform decision, getting back to our earlier conversation. And I think what the reality was is that we did a redesign basically, made it a little bit warmer, a little prettier, and suddenly everyone got over that concern. The reality was just designers didn’t like the look and feel, and designers are very tuned into look and feel.But I still think that there’s something to that idea of how do we get Figma out of your way? How do we make it there when it should be there, but how do we keep the focus on your content? And there’s so much we could explore in that direction still. I see 10 years of work to figure that out. There are ideas that I was pushing for in the first two years of Figma, that we had to shelve, that have recently started to come back up again. Not from me, but from our team. And I’m like, “Yeah, I’ve looked at that. That’s a hard one. Let’s do that after we finish this project.”Give me an example.One thing that I just get so excited by, but it’s a very hard problem, is just more contextual UI. And you see this in some tools, especially in the 3D space, but I think that there’s a lot of challenges with how do you both maintain the predictability of an interface while also making it so that you don’t have to move your mouse too much? And I also think that the more deep that you want an interface to go, the more power you need to be able to get to, the more sub menus and whatnot that some people have to navigate. So it’s a very cool vision to go, how do you bring up exactly the right things at exactly the right time? And I think there’s something there that Figma needs to explore at some point, but I don’t think it’s an easy problem. And I’m definitely looking forward, though, to just going for it at some point and trying to figure it out.Is it the curse of every software CEO that you try to invent Clippy at the end?Try to what?Try to invent Clippy at the end.I’m actually not talking about Clippy here.Really?No.You think bigger than that?Bigger than Clippy? No, I think Clippy is... Maybe I just didn’t describe…You don’t want like a Figma avatar popping up and be like, “Yo, this design’s kind of played”?So it’s funny you mentioned that. Our internal mascot that just won’t go away, we call it Flippy. It’s like a Figma logo with this weird hat on. So it’s an internal joke and then it just keeps popping up in random places. It’s like a meme that just won’t stop. And then Flippy ends up getting killed in various ways, internal decks and stuff like that. But no, I must have not described this correctly before and maybe that’s because it’s still vague and still out there, but it’s a fundamentally different metaphor than an assistant.It understands what you’re doing and provides you the tools.No, I am not talking about that at all. I’m talking about, how do you instead provide the right actions and interface at the right times.Do you think that is an AI-related problem?I actually don’t.Really?Maybe it is. Maybe that’s some gap we need to explore more, but I think that you still need the predictability if it’s a professional tool. You have to think a lot about how do you always have the thing available that people expect, and how do you have a consistent way to get there, and that’s a hard thing to solve.One of the things you and I talked about the last time that this brings to mind is there are things on the web you cannot do, and the one that you brought up was pen input. WebAssembly and WebGL are just not fast enough or performant enough to do pen input. Maybe that’s changed in the past year since we talked, but it feels like the pen, that modality is where you want more of that. My pen can just do whatever I need it to do right now. Is that a better framework of thinking about it?I think you could do a lot of stuff with pen. So I have to look back at our last interview and conversation to figure out what I said there. Maybe one thought experiment is what would it take to make it so that Figma is as least intimidating as possible, as approachable as it could possibly be? Could you get away with somehow removing the properties panel on the right-hand side, the layers panel on the left-hand side? What would be your path to get there? And this is sort of an extreme thought experiment, but I think if you follow that, you still need to have the right properties at the right time, and how could you surface those contextually in the UI but in a consistent way? I think that would be a really interesting way to both blend into the environment of the user’s content as well as creating flow for the user. And to me, somehow that rhymes with solarpunk in my head. Getting back to the original conversation.Outside of solarpunk, are there other design trends you see on the web that maybe are not as aesthetic design trends but more functional design trends?I think it’s a trend in conversation, but I think that there’s two trends that are happening simultaneously right now in the culture. We’ve maybe touched on both of them in this conversation so far, which is, there’s existentialism and people being like, “What is the future of humanity in a world of AGI?” And there’s optimism. There’s the point of view that it’s going to be okay. Look, when we did the deal with Adobe in the first place, my head space in 2022 was, “Oh my god, AI is coming. This is clearly exponential as a technology. I don’t know what this does to us. Is this one-tenth our market, is it 10x our market? What does it mean for creatives and designers?” And I was like, it’s better to team up in this world with Adobe and to navigate this together and to figure this out together than it is to go it alone.Through the deal period, through the last few years, I have grown increasingly optimistic about… I don’t know what’s going to happen with super intelligence. If we get there, who knows? But in a world of just AGI even, I think that there’s a human in the loop. I have a lot of optimism about that future and how things will work out, not just for design, but for knowledge work in general. I hope that more people start to see that and that trend of that optimism continues.That’s great. Alright, that’s it. Thank you Dylan so much. Thank you for having me.",
    "created": 1710770400
  },
  {
    "kind": "article",
    "url": "TEST 21",
    "source": "The Verge",
    "title": "xAI open sources Grok",
    "text": "On March 11th, Elon Musk said xAI would open source its AI chatbot Grok, and now an open release is available on GitHub. This will allow researchers and developers to build on the model and impact how xAI updates Grok in the future as it competes with rival tech from OpenAI, Meta, Google, and others.A company blog post explains that this open release includes the “base model weights and network architecture” of the “314 billion parameter Mixture-of-Experts model, Grok-1.” It goes on to say the model is from a checkpoint last October and hasn’t undergone fine-tuning “for any specific application, such as dialogue.” As VentureBeat notes, it’s being released under the Apache 2.0 license that enables commercial use but doesn’t include the data used to train it or connections to X for real-time data. xAI said in a November 2023 post that the LLM Grok was “developed over the last four months” and is targeted for uses around coding generation, creative writing, and answering questions. After Musk bought Twitter (now X), the code behind its algorithms was eventually released, and Musk has openly criticized companies that don’t open source their AI model. That includes OpenAI, which he helped found but is now suing, alleging the company breached an original founding agreement that it would be open source. Companies have released open-source or limited open-source models to get feedback from other researchers on how to improve them. While there are many fully open-source AI foundation models like Mistral and Falcon, the most widely used models are either closed source or offer a limited open license. Meta’s Llama 2, for example, gives its research away for free but makes customers with 700 million daily users pay a fee and won’t let developers iterate on top of Llama 2. When the Grok chatbot launched, accessing it required an X subscription (aka a paid blue check). Grok’s pitch was to be a more irreverent, up-to-date chatbot alternative to OpenAI’s ChatGPT or Google’s Gemini. Instead, in our early testing, it was unfunny and lacked anything that could help it stand out against the more powerful and advanced chatbots available elsewhere.",
    "created": 1710724246
  },
  {
    "kind": "article",
    "url": "TEST 22",
    "source": "The Verge",
    "title": "The return of Gamergate is smaller and sadder",
    "text": "The Discord server at the center of Gamergate 2.0 is, in some respects, like any other online community. While I was there, I observed people talking about their day, their jobs, and their interests. Its members streamed themselves playing Bejeweled and showed off their personal video game development projects. But one chat room over, the server was filled with racist memes, sexist and ableist slurs, antisemitic messages, and incitations of violence against women and people of color. And at the center of it all was one video game narrative development company: Sweet Baby Inc.This growing group of people want to believe themselves a new incarnation of Gamergate, a harassment campaign started in 2014 that targeted women speaking out against misogyny in the video games industry. Back then, the harassers used obfuscating tactics, cloaking their oftentimes violent harassment in the veneer of legitimate complaint. Social media gave a platform to those “legitimate complaints” while the games industry itself remained largely silent, allowing the movement to grow into a many-tentacled behemoth that bolstered the ranks of the “alt-right” movements that plague our political landscape to this very day.But this time, instead of assembling under the false banner of “ethics in journalism,” this new campaign has chosen “wokeism” and Sweet Baby as the focus of their grievances. The result has been a wave of bigoted harassment targeting marginalized developers, journalists, and gamers. On social media, the employees of Sweet Baby are subject to a deluge of death threats. Developers who’ve spoken out in support of Sweet Baby are faced with similar treatment, with several making their accounts private in an attempt to stem the tide of abuse. Journalists reporting on the story have become subject to the same harassment they’re covering. The resulting frenzy has been amplified by major actors in the right-wing media sphere, including Libs of TikTok, Matt Walsh, Ian Miles Cheong, and Elon Musk.“The things they say in our inboxes is … the most evil stuff you’ve ever seen in your life,” said David Bédard, co-founder and COO of Sweet Baby, in an interview with The Verge.The harassment campaign against Sweet Baby echoes the Gamergate movement of 10 years ago, once again targeting women, people of color, and journalists in the games industry. But this time, the events are playing out differently. Developers and gamers are pushing back, affirming that the kind of diversity these people rail against is here to stay. And after speaking with Sweet Baby employees and spending time with their detractors, it’s clear the goals of this harassment campaign are largely a reactionary backlash against trends in video games that cannot be meaningfully stopped.“The things they say in our inboxes is … the most evil stuff you’ve ever seen in your life.”Sweet Baby was co-founded in Montreal in 2018 by Bédard, who’d previously worked in games marketing at Eidos and Ubisoft, and Kim Belair, a writer and narrative designer who’d worked at Ubisoft and Reflector Entertainment. The narrative development company offers services like script writing, story reviews, and sensitivity readings. “Essentially, everything that touches storytelling in games, whether creative or technical,” Belair said in an interview with The Verge.The neo-Gamergate fervor surrounding Sweet Baby started with a Brazilian Steam user by the name of Kabrutus. In January, he created the Steam curation page called “Sweet Baby Inc Detected” (SBID), which, the page’s description explains, is “a tracker for games involved with Sweet Baby Inc.” According to an interview with Kabrutus in Geeks and Gamers, he believes Sweet Baby is responsible for “forc[ing] political agendas and DEI (the abbreviation for diversity, equity, and inclusion) into their games.”Kabrutus believes that any diverse characters or stories in Sweet Baby games are the result of its employees exerting pressure on developers to make additions or changes they might not otherwise make. “I started noticing patterns in some games, like ugly women and male characters being weakened to make female ones look stronger,” Kabrutus said in Geeks and Gamers. The game that brought his attention to Sweet Baby was God of War Ragnarök. “I think anyone who played God of War III would find it really weird when Kratos decides to spare Thor and says, ‘We must be better.’ That simply didn’t fit the character.”According to Kabrutus and the thousands of followers he’s recruited through his Steam group and Discord server, developers have no choice but to make these “woke” narrative changes. SBID argues that game companies are forced to add “wokeness” to improve their ESG scores — a measure of environmental, social, and governance considerations — if they want to land investors. SBID supporters also argue that Sweet Baby has coerced developers into making changes through fear, pointing to out-of-context quotes from the company.The most widely circulated example involves clips of a talk Belair, a Black woman, gave at the Game Developers Conference in 2019. In it, she counsels developers to “terrify” their bosses with the “threat” of “cancellation” if their requests for inclusivity are not met. But a look at the clip’s full context tells a different story. It’s clear that Belair didn’t want developers to scare their superiors into inclusivity. Instead, she wanted them to enlist support from the employees — those on the marketing and community side — who stand to receive the most backlash from players if those concerns aren’t taken seriously.In reality, Sweet Baby and other video game consultants are contracted by the studios to support the studios’ own goals. “They consult,” wrote Mary Kenney, the associate narrative director on the forthcoming Wolverine game from Insomniac Games who worked with Sweet Baby on another Insomniac title, Marvel’s Spider-Man 2. “They do research, pitch ideas, give feedback, and maybe even write scripts. But none of that gets into the game unless the core dev team agrees with it.” “Sometimes we’ll be brought in to just look at a project storyline to give feedback on it to find ways that it can better kind of align with gameplay mechanics,” Belair said.Kyle Rowley, game director on Alan Wake 2, responded to a rumor on X that Sweet Baby was responsible for changing Saga Anderson, one of the game’s main characters, from a white woman to a Black woman. “It’s absolutely not true,” he wrote.To date, Kabrutus’ curation list features 16 games, including Assassin’s Creed Valhalla, Suicide Squad: Kill The Justice League, and Sable. All the games on the list are marked “not recommended,” a rating that has nothing to do with the game’s perceived quality — one game on the list, Tales of Kenzera: Zau, doesn’t launch until April — but because of Sweet Baby’s involvement in the game’s development. SBID serves as a warning to like-minded gamers not to buy anything on the list.“We’re just tired of seeing people’s creative visions being butchered in order to add something that’s not even necessary or asked for,” wrote Xynjy, a moderator for the Discord server, in a DM conversation.The reality is game development, especially AAA development, involves contributions from massive multidisciplinary teams, and it’s actually quite difficult to attribute any one element to an individual or specific team.“You wouldn’t ask a programmer ‘which part of this did you code?’” said Bédard. “The whole thing is a team effort, and it only works because everything fits to the other parts really well.”It is deeply ironic that one of the group’s stated purposes is to rally against “forced diversity” in games when developers are often forced to make their games more homogenous.“I have never in my entire career seen anyone pressure a developer to make a character more queer or less white,” wrote Christina Pollock, a veteran game developer. “I have, however, seen many instances of developers being forced to change their characters to be straight and / or white.”Many other developers echoed her sentiment. “The anti-censorship crowd like to argue that developers should be able to make the game they want, without being told to make changes to please the market,” wrote Gavin Young, a developer on Rainbow Six Mobile. “Believe me, we’re trying: we put diverse characters in games because they represent our teams and our friends.”Another common refrain from members of SBID is that they actually don’t care if a character comes from a marginalized background, so long as their identity isn’t the sole focus of their character.“My problem with most media nowadays is that they include Black or LGBTQ characters without giving some thoughts about them,” wrote SBID’s Discord moderator. “But [they] forget the most important aspect of a character: [their] relatability and how [they] feel like a real person that you can meet in real life.”But that need for character depth is the exact reason why developers contract with Sweet Baby. For their work on Alan Wake 2, Belair said, “We were specifically called to look at Saga’s story, [to look at] how it’s told, how [the developers] could better shore up aspects of herself, how her story reflects aspects of her identity, and essentially how to realize her as a fully human, fully authentic character.”This lack of understanding about game development, whether intentional or not, belies the group’s true function — a convenient excuse for “anti-woke” reactionary gamers to indulge in racist and misogynistic behavior that’s typically shunned in online communities. “When I act racist, homophobic or whatever [...] I feel free,” one poster wrote in the Discord. The arguments and discussions observed in the Discord and on Steam all harken to the reactionary right-wing movement that has dominated the political landscape since Barack Obama’s presidency. Then, as now, many young white men have grown increasingly alienated from a world they feel has left them behind. A supposed de-emphasis of white males in pop culture in favor of women, people of color, and queer people exacerbated this alienation, especially in video games. Statistically, white men still dominate the video game space in terms of who is playing, making, starring, and writing about games. But the landscape is changing. Companies are putting a greater effort in diversifying their games. Games media is more likely to call out when diversity is absent or done poorly, and the kinds of anti-social behaviors that were once the hallmark of gaming culture are becoming less and less tolerated. As a result, Kabrutus and his followers feel disenfranchised.“We’re in an age where [...] if you don’t want to see a BLM or a Pride flag in a game, you’re a bigot,” wrote a member in the Discord. “Where if you care that the women in games have big tits while there are giant, muscular, shirtless dudes, you’re a misogynist.”In order to regain some semblance of control, the members of SBID have chosen to attack something that neatly represents their every grievance — a small company that specializes in improving a game’s narrative staffed in part by women, queer people, and people of color. “We’ll have to make sure Sweet Baby is actually dead before picking a next target to go after together,” wrote a user on SBID’s Steam forum.Based on the time I spent lurking in their Discord, it became clear these people aren’t actually here to create meaningful change for their cause. Most are simply there for the vibes, rancid though they are. “I’m just here cause it’s fun, nothing’s gonna happen,” one user wrote in the Discord.“I’m just here cause it’s fun, nothing’s gonna happen”“[There are] lots of emotions and passion bottled up from being silenced for an extended period of time,” wrote another member of the Discord. “This [movement] is basically causing everyone to vent out their frustrations.”That doesn’t mean the group is harmless. Ten years ago, Gamergate unleashed a wave of harassment targeting women, journalists, and people of color. It created the template for a kind of violent, right-wing internet culture that persists to this day. And the guise of “ethics in games journalism,” thin as it was, allowed the movement to shield its true aims. Since SBID to itself as the second coming of Gamergate, it’s important to apply the lessons not learned from the previous Gamergate and call this bigoted movement for what it is, loudly and vociferously.Diversity in video games isn’t going anywhere, and the practice of hiring consultants to punch up narratives certainly isn’t going to change. Improving diversity continues to be an animating force in the industry. Xbox, Nintendo, and Sony have made DEI a core part of their business with commitments to diversify not only their workforces but their games as well.  “DEI is a moral necessity until the people making games are a decent approximation of the world they are making games for,” wrote Sam Barlow, director of several award-winning games, including Immortality, Telling Lies, and Her Story.SBID’s championing of developer “freedom and creativity” fails to consider the possibility that the “diversity” they oppose might actually be what developers and gamers truly want. It’s the reason studios hire companies like Sweet Baby in the first place.And while this movement matters to Sweet Baby employees because of the harassment they’re receiving, in the larger context of the video game industry, it seems to be quickly fizzling out.Steam has apparently taken some action against SBID. As of publication, the vast majority of the SBID’s Steam discussion forum — 100 pages worth of threads — have been deleted, and existing threads are currently locked.Meanwhile, Sweet Baby’s clients are sticking with the company. “The studios that we’re currently working with have reached out and offered their support, saying like, ‘Hey, we see what’s happening online and just know we stand with you,’” said Chris Kindred, a narrative designer at Sweet Baby.In an email to The Verge, Gregorios Kythreotis, creative director on Sable, wrote, “[Sweet Baby was] lovely to work with, extremely professional and easy going, they respected our creative direction and it was a really great experience. We’re really grateful to them.”Mary Kenney, who worked with Sweet Baby on Spider-Man 2, called them “one of the finest in the biz.”“I’m so lucky to have worked with that team. I hope to do so again,” she posted on X. “I hope asshats don’t drive out some of the most talented, passionate people we’ve got.”",
    "created": 1710784800
  },
  {
    "kind": "article",
    "url": "TEST 23",
    "source": "The Verge",
    "title": "How to get more battery life out of your Wear OS smartwatch",
    "text": "Some days away from the home or office can seem like a constant battle against battery life: your phone is dying, your laptop is dying, and your smartwatch is dying. Despite all of the advances we’ve seen in tech in recent years, battery life doesn’t seem to be getting much beyond the standard 24 hours of use for a lot of devices.Limited by the physical restrictions of their hardware, manufacturers are putting battery-saving tweaks into software instead, like the Low Power Mode you’ll find on the Apple Watch and the iPhone. These settings can actually make a difference, and they’re available on Wear OS, too.In Victoria Song’s Pixel Watch 2 review last year, she mentioned being impressed by the improved battery life compared to the original — but today, that 24-hour ceiling is still in place. With my own Pixel Watch 2, I’m usually anxious about running out of juice before the end of the day if I didn’t charge it overnight — though I have found a few ways to eke out extra battery life. I’ll get into those below.These steps apply to the Pixel Watch 2 with the latest Wear OS 4.0 installed. If you’re using a different Wear OS watch (like the OnePlus Watch 2 or the Samsung Galaxy Watch 6) these tricks should work the same way. You might find that the screens and menus you see vary in places because of the way different companies have adapted Wear OS.Start with the screenThere’s lots to tweak in the Wear OS Watch app for Android. To save battery, you can keep the screen dark for longer periods of time.A lot of smartwatch battery drain is due to the screen, so it helps to have the display on as little as possible. Start by going to the Wear OS Watch app on your phone and tapping Watch preferences > Display and gestures to make changes.Reduce the screen timeout delay so the display turns off earlier after you’ve stopped interacting with it.Turn off the always-on screen option so the display isn’t using battery life when you’re not looking at it.Turn off the tilt-to-wake option — this can be handy for checking the screen, but it can also be activated accidentally, which uses battery power.With the always-on screen and tilt-to-wake options turned off, you’ll need to tap on the screen to see the time or anything else. It’s a compromise, but just about every battery-saving measure is, one way or another.You can also adjust the brightness of the screen by swiping down on the watchface and tapping the brightness icon (the sun symbol). There’s also an Adaptive Brightness option here, which adjusts the brightness for you, depending on the ambient lighting — this can save you battery life, but not as much as having the display dimmed permanently.Choose a new watchfaceYou can customize watchfaces to have as little on-screen activity as possible. You’ll find plenty of different watchfaces to choose from. Speaking of the screen, your watchface can make a real difference to battery life. It dictates how many pixels are illuminated, after all. Switching to a less busy, more minimal look is something you can try. Not only can you look for watchfaces with as little on screen as possible but you can also reduce the number of complications on each one.Tap Watch faces inside the Watch app on your phone.Swipe left and right to browse the watchfaces already set up. If you choose one of these, tap Edit to modify it (perhaps with fewer on-screen elements) or Use on watch to apply it to your wearable.Choose Add new to pick another watchface from the gallery. When one is selected, you can edit its colors and complications before tapping Add to apply it to your watch.Tone down notificationsWear OS gives you full control over the notifications you get. Only turn on alerts for the watch apps you really want to hear from.Having your watch buzzing and beeping all day can be a drain on battery life, so if you can do without some of these notifications — or at least have them be less audible — you can get extra time between charges.From the Watch app on your phone, tap Notifications.Tap See all apps from last seven days, then change the Most recent drop-down menu entry to All apps.Turn off the toggle switch for the phone apps you don’t want to hear from on your watch.There are more features on your watch that you can edit. Swipe down on the main watchface, then tap the gear icon to get to Settings.Tap Apps & notifications from Settings to change which apps installed on your actual watch can send notifications.Under Sound and Vibration in Settings, you can control notification, call, and alarm volume and vibration levels. Dial these down to save battery life.Watch settingsTurning off Wi-Fi can give you some extra battery life. If you’re not expecting a call, you can limit watch vibrations.If you head into the Settings page on your watch by swiping down from the top of the watchface and tapping the gear icon, you can disable a few more features to reclaim some battery life. There are trade-offs in each case, which you might (or might not) be willing to put up with. However, they could come in handy if you’re running low on battery.Tap Location from Settings, then turn off Use location. This disables the GPS, so your watch won’t know where it is (for navigation, for example) if it’s not connected to your phone.Tap Connectivity from Settings, then Wi-Fi, then turn off Wi-Fi. With this off, your watch won’t be able to connect to Wi-Fi directly — everything will have to come through your phone.If you’re using an LTE watch, tap Connectivity, Mobile, and Mobile again, then Off. Your watch will no longer be able to get online via cellular networks.Tap Google from Settings, then Assistant, and disable “Hey Google.” You won’t be able to wake up Google Assistant with your voice with this turned off, though you can still press and hold the side button.You might need a bit of trial and error to work out which features give you the biggest boosts in battery life and which features you can live without if it means less recharging  — but you should find at least some of them helpful.",
    "created": 1710775852
  },
  {
    "kind": "article",
    "url": "TEST 24",
    "source": "The Verge",
    "title": "Playtron: the startup hoping to Steam Deck-ify the world",
    "text": "Handhelds are the future of gaming — but there are reasons the category hasn’t exploded yet. The Nintendo Switch is locked down, Windows can be cumbersome, and Valve’s pick-up-and-play SteamOS hasn’t yet escaped the Steam Deck.What if there were an Android of gaming, an OS you could install on any capable hardware to get a controller-friendly PC experience? Imagine an “Epic Deck” that could actually play Fortnite, a “5G Deck” for cellular carriers, or maybe a “PlayStation Deck” for Sony’s growing PC ambitions.“If Valve can do this with Steam, we can do this with anything,” says Kirt McMaster, CEO of Playtron.Today, Playtron is coming out of stealth with $10 million in funding, roughly 18 employees, and a plan to challenge Microsoft, Valve, and Apple for the next hundred million gamers. And after seeing a stack of internal planning documents, speaking to Playtron’s allies, and trying an early alpha, I’m cautiously optimistic.It begins with a Linux-based operating system that plays Windows games, just like the Steam Deck — except this one isn’t tied to Steam. Games you’ve bought from the Epic Games Store are first-class citizens, too.Today, in early alpha form, it doesn’t look all that exciting: a lightweight OS that replaces Windows or SteamOS on your existing handheld gaming PC, with fewer features and compatible games than its peers. While it definitely played Death Stranding, Dave the Diver, and hours of Balatro just as well as my Steam Deck, not all games that work there necessarily work here yet.But within a year, Playtron believes it’ll be competing with Windows as the OS for gaming handhelds. “We’re in conversation with numerous OEMs and mobile operators to build and deploy Playtron devices around the world in the 2025 timeframe,” McMaster tells me — adding that Ayaneo plans to ship a native Playtron handheld by the end of 2024.I put the Playtron alpha on this Steam Deck and played a few games on it. Most buttons work, but there are no overlays or touchpad mouse clicks yet. Photo by Sean Hollister / The VergePlaytron will cost companies like Ayaneo a fraction of the price of Windows, he says, around $10 per head instead of the $80 that OEMs tell him they spend today. And he says games like Fortnite and Roblox shouldn’t have to fear hackers reverse engineering their anti-cheat solutions because its Fedora Silverblue base has an immutable file system. (I thought SteamOS was immutable, too, but I’ll let more knowledgeable Linux users argue that one.)Playtron isn’t just looking at handhelds, by the way; it imagines every laptop, tablet, phone, TV, and car becoming at least a part-time gaming machine. Remember Apple’s journey to bring big games to its own Arm-based silicon? McMaster says he’s hired the developer behind Box86 to bring Windows games to efficient Arm-based silicon, potentially getting us out of the rut where today’s portable PCs max out at two to three hours of AAA gaming battery life. They’ve already got The Witcher 3 running on a Qualcomm Snapdragon 8 Gen 3 smartphone — admittedly at under 30fps with somewhat potato-y graphics.But while Qualcomm has been talking a big game about its Snapdragon X Elite chips coming this summer, both McMaster and Qualcomm exec Micah Knapp suggest it might take a couple more years for Arm to match x86 for gaming. “Have I seen faster? Yes. Have I seen better battery life? Yes. Not one example I can point to with both,” says Knapp.If you’re wondering how a brand-new startup convinces hardware manufacturers and mobile carriers with what looks like a glorified games launcher and a few big ideas, you’re not alone. Even Playtron’s allies aren’t trying to claim this is a sure bet.“It’s a game of conditional probabilities; 10 different things need to happen and each of them has a very low probability of success,” says Carlos Castellanos, an investor at Samsung Next who led Playtron’s first round of funding. Game publishers, hardware manufacturers, cellular carriers, and the community would all need to be engaged.But Castellanos and former PlayStation CEO Shawn Layden, a friend of the project, think this team has a chance to win at a time few others are stepping up to lead. “We don’t go out into the world awash in handheld gaming platforms,” says Layden. “There’s room for someone who can make the right proposition.”And Castellanos suggests Playtron may have the right “conductors” to play that particular symphony. The Playtron game library pulled in titles from my Steam and Epic libraries — and my cloud save games from Steam came along for the ride. Photo by Sean Hollister / The VergeMcMaster helped create the US arm of Boost Mobile and was CEO of Cyanogen, the company that used to ship custom sideloadable versions of Android and helped OnePlus launch its debut phone. Playtron chair John Lagerling knows a thing or two about spreading an Android-like OS — he used to be Google’s director of Android global partnerships, helping Google ink deals with chipmakers and companies like LG, Asus, and Samsung to produce Google Nexus phones and tablets. “It’s my understanding that [Playtron] have deepening partnerships with potential providers of the chips and hardware,” hints Castellanos. A few other things Playtron told us:Some of the company’s seed funding comes from blockchain companies including Polychain, Circle, Sui, Mysten Labs, and CMT Digital. There’s a thought that maybe players would buy games with cryptocurrencies.Playtron plans to promote some games in the launcher itself.But Playtron isn’t sure it’ll have its own store; it wants to be the distribution platform.BTW, you can’t currently purchase games through Playtron; stores need integrated first.Playtron wants to give games a “quality score” to verify they run well and steer players away from ones that don’t unless they opt in to seeing lower scores.“We don’t care about running the hundred thousand games that are on Steam... we’re going to focus on the top games.”“Right now a significant portion of tier 1 global mobile network operators are interested in launching this category and class of device to their customers around the world.”ChimeraOS and Heroic Games Launcher devs are free to keep working on those projects.“If you’re a contributor to the Linux gaming community, we’d love to hire you.”For Cyanogen fans: McMaster praises Steve Kondik for building an amazing community and says he doesn’t blame him for being angry. That said, Lagerling also helped broker Google’s short-lived purchase of Motorola, and McMaster probably destroyed CyanogenMod while trying to turn it into CyanogenOS. He tells me he learned that you shouldn’t try to commercialize an open-source project with a significant history because it can lead to culture wars — but says that, this time, everyone’s aligned from the start. “They all have the open-source ethos, but they’re all gamers... they want to build an open source operating system that allows them to play unencumbered.” In addition to the developer of the Box86 emulator, the Playtron team includes developers of ChimeraOS, which similarly cribs a lot from SteamOS, and the Heroic Games Launcher that makes it easier to play Epic Games Store and GOG games on Linux handhelds. Co-founder and CTO Franck De Girolami leads product: he was a programmer and later project leader on the Alone in the Dark games, which pioneered the 3D survival horror genre. Playtron hasn’t quite decided just how open source it’ll be, though, and how much it will cater to Linux power gamers versus the next hundred million that Playtron hopes to bring into the fold. McMaster tells me Playtron’s definitely skewing more toward the ease of use of a Nintendo Switch, partnering with Perplexity on an AI agent that could keep “core-casual” gamers from ditching games prematurely just because they got stuck on a challenge or puzzle. There’ll be no Linux desktop mode. In the alpha, most settings menus are bare-bones. Wi-Fi, audio, and brightness adjustment all work, but there are no controller or performance adjustments, for example. Photo by Sean Hollister / The VergeAnd yet, Playtron’s also hoping to get help from Linux power users, releasing a public alpha in the next 60 days so the community can request features, contribute to code repositories if they can, and help improve game compatibility by building launch configs and test scripts. (Playtron says it’s working on a helper tool that uses AI image recognition to automatically press the right buttons to launch a game properly.)A lot of things would have to go right for Playtron to succeed, and it probably won’t be the only company shipping a handheld OS. Valve’s Pierre-Loup Griffais now tells me the company’s finally working directly with other companies to bring SteamOS to its handhelds, and I’m currently testing a promising SteamOS clone called Bazzite. Microsoft also won’t sit on its hands forever. But for the moment, Playtron sounds intriguing — particularly for anyone who wants to challenge the status quo of Steam PC gaming.",
    "created": 1710774000
  },
  {
    "kind": "article",
    "url": "TEST 25",
    "source": "The Verge",
    "title": "Starship Home uses mixed reality to make your living room an intergalactic greenhouse",
    "text": "Starship Home, a cozy mixed-reality game for the Meta Quest 3, is trying to get to the heart of “what makes a game meaningful in mixed reality.” That’s according to developer Doug North Cook, who wrote on Reddit that the game, which turns your environment into a custom spaceship and you into an intergalactic horticulturist, is indie studio Creature’s “first answer to that question.”A Meta Quest blog post says players will customize their starship by “strategically placing virtual windows, control panels, and other components” in their room. Outside the windows, the game’s trailer shows you’ll see things like space creatures, planets, cloud-tops, and travel animations as you leave planets. When players land on a planet, they’ll collect plant clippings and nurture them aboard their ship. The game uses the Quest 3’s automatic room meshing, so you won’t have to do any manual blocking to tell the headset where things are in your space.This could be your space room. Image: CreatureStarship Home’s story puts players in charge of exploring planets and saving alien flora from a “sinister blight that threatens plant life across the galaxy.” Other aspects of the game will include entering the plants’ dreams, navigating with a star chart, interplanetary space jumps, and “unraveling the mystery” of the sickness afflicting the plants, according to Creature’s website.How about a plant that looks at you? Image: CreatureThe whole thing sounds like it could be very fun — if it’s done right. The developer doesn’t seem to say whether your spaceship persists across play sessions (it sounds like it might, given Cook’s Reddit reply saying there will be save files “so you can each have your own Starship”). If it does, that could give you a real reason to actually put the headset on every day. You know, the sort of time-honored tradition seen in everything from Animal Crossing to Tamagotchi. “Sorry, family,” you might say, “I need to go down to the basement to play with my trains tend to my space plants.”Starship Home is a Quest 3 exclusive; its first, according to UploadVR. At the moment, it doesn’t have a specific release date, but Creature says it’ll be out in the third quarter this year.",
    "created": 1710622587
  },
  {
    "kind": "article",
    "url": "TEST 26",
    "source": "The Verge",
    "title": "SpaceX is reportedly building a network of spy satellites for US intelligence",
    "text": "SpaceX’s Starshield unit has had a classified contract with the US National Reconnaissance Office (NRO) since 2021 to build a network of “hundreds” of spy satellites for the agency, Reuters reports today, citing unnamed sources “familiar with the program.” A Wall Street Journal report in February listed a classified $1.8 billion SpaceX contract with a then-unnamed government agency. Now Reuters has attached a name, and that it’s to build a network of “hundreds of satellites bearing Earth-imaging capabilities that can operate as a swarm in low orbits.” The report didn’t say when the network will be operational or what other companies are involved. It does mention that a US database of space objects lists satellites deployed by SpaceX that the company and government have not acknowledged and cites sources confirming those objects as Starshield prototypes.A screenshot from SpaceX’s Starshield website. Screenshot: Wes Davis / The VergeSpaceX describes Starshield as a government-focused secure satellite network, and Elon Musk tweeted it “will be owned by the US government and controlled by DoD Space Force.” Last fall, the business unit signed a US Space Force contract to provide satellite communications for the military via Starlink.According to Reuters, if the NRO contract is a success, it would “significantly advance the ability of the U.S. government and military to quickly spot potential targets almost anywhere on the globe.While an NRO spokesperson reportedly declined to comment on Reuters findings about SpaceX’s involvement, it confirmed to the outlet that it’s working to develop “the most capable, diverse, and resilient space-based intelligence, surveillance, and reconnaissance system the world has ever seen.”",
    "created": 1710615408
  },
  {
    "kind": "article",
    "url": "TEST 27",
    "source": "The Verge",
    "title": "Pixel 8 drops below $500 for the first time",
    "text": "If you’re in need of a solid smartphone upgrade without the bill creeping into mortgage territory, there aren’t many better options than the Google Pixel 8. When you can get one for under $500? Even better. The 128GB unlocked model is down to $499 ($200 off) at Amazon, Best Buy, and the Google Store. That’s $50 cheaper than the price we saw during Black Friday last year. The 256GB model is also $200 off at those retailers, bringing it down to $559.99. Both are down to the lowest prices we’ve seen so far.The Pixel 8 is really solid, especially if you’re not interested in the gimmicky extras that can bloat the user experience on other devices. Google has optimized the software specifically for its custom Tensor G3 chipset, which offers great performance and enables AI-powered computational photo and video features as well as new AI search features. Samsung and OnePlus have stolen some of its thunder in 2024, but the Pixel 8 is still one of the best Android phones you can buy today.Read our Pixel 8 review.The Pixel 8 comes with just a couple of key upgrades over the Pixel 7, and it misses out on several higher-end features on the 8 Pro, like a telephoto lens. But its combination of price, features, and the promise of seven years of OS updates makes it the best mainstream Android phone to buy right now.Whether you’re outfitting your home with smart tech for the first time or looking for an inexpensive replacement for aging bulbs, a four-pack of TP-Link’s Kasa RGB smart bulbs is a great place to start. It’s an incredible value now that it’s down to $27.99 ($13 off) at Amazon, which works out to about $7 per bulb. The 60W-equivalent bulbs are plenty bright for most needs at 800 lumens. The Kasa app lets you dial in the exact color and luminance levels you prefer. You can manage each bulb individually or in groups with scenes, smart actions, routines, and schedules. The app also lets you monitor energy usage for each bulb.TP-Link’s multicolor light bulbs are an affordable way to outfit a home with smart lighting. The 60W-equivalent bulbs don’t require a hub, yet you can control them with either Amazon Alexa or Google Assistant.More Monday deals to shopBetween March Madness, WrestleMania 40, the 2024 Olympics, and the return of HBO’s House of the Dragon later this summer, we’d bet many of you are thinking about a TV upgrade. You might consider checking out the TCL QM8, with the 65-inch model down to around $999 ($300 off) at Amazon and Best Buy. The 75-inch model is $600 off at Best Buy, resulting in a record-low $1,199.99 price. You can also get the 85-incher for $1,699.99 ($700 off) at Amazon and Best Buy. TCL’s QLED sets contend admirably with bigger name brands on picture quality, specs, and features such as Mini LED full-array backlighting with 2,300-plus local dimming zones, 2,000 nit peak brightness, and up to 240Hz variable refresh rates for gaming.Amazon’s cloud gaming service, Luna, isn’t everyone’s first choice, but it works well. The official Amazon Luna wireless controller is pretty decent, too, for the $49.99 ($20 off) it’s going for at Amazon. It includes a free one-month Luna Plus trial (normally $9.99 per month) that offers more than 100 titles to check out. Luna’s controller is similar in form to Xbox’s — it uses the ever-popular off-axis analog stick layout and has a similar AA battery compartment. You can connect it via USB-C or Bluetooth to a variety of devices, including Android, iPhone, iPad, Amazon Fire TVs and tablets, and Windows and Mac computers. When you’re using it to play Luna, the controller can also connect directly to Amazon’s servers using Wi-Fi for reduced latency. If you own one of Apple’s latest iPad Pro, iPad Air, and iPad Mini models, the second-generation Apple Pencil is an excellent tool and toy to pair with it. It’s down to $79 at Amazon, Best Buy, and Walmart, matching its all-time low. The Apple Pencil is an excellent stylus for drawing and taking notes, and unlike the entry-level USB-C version, it recharges by attaching magnetically along the top of supported iPads. It also builds on the original with improved pressure sensitivity and a double-tap gesture that lets you quickly swap between drawing functions. On M2-based iPads, you can also hover the Pencil over its display to see where you’ll make markups once it makes contact. Newer iPad Air and iPad Pro models are imminent, and Apple may introduce a new Apple Pencil model alongside them, so don’t bite on the deal just yet if you’re planning to upgrade.Sam’s Club members can get the 64GB Apple TV 4K (third-gen) for $99 ($25 off). There’s almost no streaming app you can’t find on the Apple TV, and you can also use it to play games or mirror anything from your iPhone, iPad, or MacBook. It also supports newer cinematic enhancements like Dolby Vision and Dolby Atmos. Read our review.It’s delightful to find a perfectly positioned wall outlet in a hotel room or coffee shop, but frustration might offset your bliss if you have just one or two available outlets. That’s where the Anker 321 outlet extender can help. It’s down to $13.99 ($5 off) at Amazon. You can also buy a two-pack for $27.99 ($8 off) at Amazon. The cube-shaped adapter is sized perfectly to drop in a travel bag and has three AC ports for the lone wall plug it takes up, plus two USB-A ports and a 20W USB-C Power Delivery port for good measure.Verge Deals / Sign up for Verge Deals to get deals on products we've tested sent to your inbox daily.",
    "created": 1710784092
  },
  {
    "kind": "article",
    "url": "TEST 28",
    "source": "The Verge",
    "title": "The best smartwatches for Android",
    "text": "Editor’s note: Fossil confirmed to us that it is leaving the smartwatch business. As a result, we’ve removed its Gen 6 smartwatch from this list as we evaluate other options. After a long stretch of slim pickings, the last couple of years have been huge for Android smartwatches. Now there are more good options than ever. But this is still a transitional era. While we’re encouraged by the stronger third-party app options, the market is still fragmented. Wear OS 4 is already here for Samsung’s Galaxy Watches and both versions of the Pixel Watch — and now, the OnePlus Watch 2. However, the larger ecosystem is still catching up. Some features, like Google Assistant, are not yet available on certain Wear OS 3 smartwatches. It may come via an update sometime in the future, but it’s been a long wait thus far. What we’re looking forProcessorAndroid smartwatches have long been foiled by outdated processors. Is the chip under the hood powerful enough to run Wear OS / proprietary RTOS smoothly?EcosystemDoes a watch work better within one company’s product ecosystem versus another? Will you have to buy a new watch if you switch phones?Smart featuresThese days, most wearables are capable fitness trackers. However, they’re not all capable of controlling your smart home, contactless payments, or interacting with digital assistants.SupportIs this device likely to last you a while, or will you need to upgrade sooner than you’d like? How communicative is the OEM about forthcoming changes?Battery lifeCan you get through the day without reaching for a charger? If not, does it support quick charging?If you’d rather wait until Wear OS settles down a bit, there are platform-agnostic smartwatches and fitness watches you can buy in the meantime. Otherwise, you’ll want to be aware of the chip and Wear OS version powering your watch. Mobvoi, for instance, only just started rolling out Wear OS 3 to its eligible Wear OS 2 watches. Speaking of Mobvoi, its TicWatch Pro 5 was the first to sport the new Qualcomm Snapdragon W5 Plus in the US, and while it’s a great watch, you may want to wait until there are more W5 Plus watches to choose from. The Pixel Watch 2 has the W5 (no Plus) chip, and the result so far has been zippier performance and better battery life. The OnePlus Watch 2 also has the W5 Plus, but we’re still putting that one through its paces.So long as you keep the aforementioned caveats in mind, Android users have more smartwatch options than ever before. I’ve rounded up my top picks, but if none of these is the right fit, you can always check out our fitness tracker guide. Best smartwatch for Samsung phonesThe rotating bezel returns on the Galaxy Watch 6 Classic. While the updates are iterative, you now get Wear OS 4, One UI 5 Watch, larger batteries, and a larger display thanks to the 15 percent thinner bezel.Sizes: 43mm, 47mm / Weight: 77g, 85g / Battery life: Up to 30 hours with AOD, 40 without AOD / Display type: Always-on OLED / GPS: Built-in GPS / Connectivity: LTE (optional), Bluetooth, Wi-Fi / Water resistance: Up to 50 meters, IP68 / Music storage: 16GBIf you have a Samsung phone, you’ll get the most mileage out of a Samsung smartwatch. And of the three watches Samsung has in its current lineup, I recommend the Samsung Galaxy Watch 6 Classic. First off, it’s got a rotating physical bezel — and said bezel is now 15 percent thinner than the Galaxy Watch 4 Classic. The updated design is sleeker than its predecessor, and the larger display is easier on the eyes and is only slightly bigger at 43mm and 47mm. I have small wrists, but the 47mm was still quite comfortable for everyday wear. It’s launching with Wear OS 4, which adds extended battery life, and finally, cloud backups. One UI 5 Watch also adds some minor health and sleep tracking improvements, but this will eventually make its way to older models. While I prefer the Classic, the base Watch 6 model may be the better option if you want a smaller, lighter, sleeker, and cheaper smartwatch.The 40mm Galaxy Watch 6 and the 47mm Watch 6 Classic are iterative updates, but deliver a familiar yet elevated experience. Photo by Amelia Holowaty Krales / The VergeOverall, the Galaxy Watch 6 series is an iterative update, but I appreciate that battery life has improved to the point where I’m no longer anxious whether it’ll last me the entire day. Of course, your mileage will vary depending on your individual use and which settings you enable. For example, turning on continuous SpO2 sensing at night can make the battery drain faster, but using bedtime mode can mitigate that so you only lose 10–15 percent overnight instead of 25–30 percent.Last year’s $449.99 Galaxy Watch 5 Pro will also get you a great overall experience. It’s not a big upgrade from the Galaxy Watch 4, but the main benefits of the Pro over other models are extra durability, neat GPS features, and battery life. I recommend picking the Pro if you’re a weekend warrior or if multiday battery life is your top priority. We got up to 65 hours in testing, though if you enable the always-on display, you’ll more likely get around 48 to 50 hours. Still, that’s a notable bump over the Galaxy Watch 6 series, the base Watch 5, and the Watch 4 lineup. Software updates (and bigger batteries on newer models) have improved the battery life on these watches, but you’ll still have to charge them daily or every other day. And the Pixel Watch only lasts around 24 hours.Samsung’s top-of-the-line flagship smartwatch has EKG readings, body composition analysis, turn-by-turn navigation, and a new body temperature sensor. Read our Galaxy Watch 5 review.The switch to Wear OS means you’re getting a much more robust third-party app experience than on Tizen-powered Samsung smartwatches, like the Galaxy Watch 3 and the Galaxy Watch Active lineup. You also get more flexibility on services than with any other Wear OS watch. For example, if you want to kick Bixby to the curb in favor of Google Assistant, you can. If you want a more in-depth look at how the Galaxy Watch 5 stacks up compared to the Pixel Watch in particular, you can check out our Versus video. (The majority of the points still apply to the Watch 6, as not a whole lot has changed.)The Galaxy Watch 5 Pro wears small for a fitness smartwatch. Photo by Victoria Song / The VergeSamsung Health also delivers a good overall fitness tracking experience, especially since you can enable turn-by-turn navigation for hiking and cycling activities. Samsung is expanding this to include walks and runs with One UI 5 Watch. We weren’t too impressed with nightly SpO2 readings, but Samsung’s overall sleep tracking continues to improve. You also get built-in GPS, body composition analysis, irregular heart rate notifications, fall detection, emergency SOS features, and EKGs. We don’t necessarily recommend the Galaxy Watch 6 series or 5 Pro if you don’t have a Samsung phone. EKGs require the Samsung Health Monitor app, which is limited to Samsung phones. Also, while you can customize the buttons to launch your digital assistant of choice, the shortcut for contactless payments is hard coded to Samsung Pay / Wallet — which is also gated to Samsung phones unless you sideload the APK — and requires you to sign up for Samsung’s service. You can work around it, but all Samsung watches work best with other Samsung devices.Read my full review of the Samsung Galaxy Watch 6 series.Best Android smartwatch for non-Samsung usersGoogle Pixel Watch 2 (GPS)$350The new Google Pixel Watch 2 now achieves a reliable 24 hours on a single charge with the always-on display enabled. It sports a new processor, multipath health sensor, Wear OS 4, and new safety features, all around a substantial update.Sizes: 41mm / Weight: 31g / Battery life: Roughly 24 hours with AOD enabled / Display type: Always-on OLED / GPS: Built-in GPS / Connectivity: LTE (optional), Bluetooth, Wi-Fi, Safety Signal with Fitbit Premium / Water resistance: 5ATM / Music storage: 32GBThe $349.99 Google Pixel Watch 2 is a significant improvement over the original. The Galaxy Watch 6 lineup will still get you a more polished overall experience, but the Pixel Watch 2 is the better choice for Android users who aren’t on a Samsung smartphone.That’s because of ecosystems. Some features of Samsung’s watches only work with Samsung phones. Broadly speaking, the Pixel Watch doesn’t care what Android phone you have; you’ll get the same experience regardless. That said, its call screening feature will only work if you pair it with a Tensor-equipped Pixel phone. It’s a little disappointing, but compared to Samsung, the Pixel Watch 2 doesn’t gatekeep health features based on what phone you have. It’s also always going to have the latest updates to Google services like Google Maps, Google Wallet, YouTube Music, and Google Assistant because, well, it’s Google’s smartwatch. With the Pixel Watch 2, Google also added Calendar and Gmail to its list of supported apps. Speaking of which, buying the Pixel Watch 2 will also get you a six-month trial of Fitbit Premium and a one-month trial of YouTube Music. The Pixel Watch 2 can now last a full 24 hours without needing battery-saving settings.  Photo by Amelia Holowaty Krales / The VergeThe most important upgrade from last year is that the battery reliably lasts 24 hours with the always-on display enabled. Some of this is due to the more power-efficient Wear OS 4 and a new Qualcomm Snapdragon W5 processor. (It also means zippier performance overall.) It’s also switched to a pin-charging system, which translates to much faster charging. You can get about 50 percent in 30 minutes, and a full charge takes about 75 minutes. Because of a firmware update, the original Pixel Watch now charges more slowly — so the difference is extra noticeable. The Pixel Watch doesn’t care what Android phone you haveCompared to last year, Google has also done a better job this year of integrating Fitbit’s health and fitness features. The Pixel Watch 2 now has a multipath sensor that enables 40 percent more accurate heart rate tracking for vigorous exercises. Plus, you can utilize heart rate zone and pace training — features other fitness smartwatches have had for a long time. The exercise views are also easier to read. It also now has a skin temperature sensor and the Fitbit Sense 2’s continuous electrodermal activity sensor (cEDA). This means the Pixel Watch 2 is now capable of proactive stress tracking. When signs of physiological stress are detected, you’ll be prompted to reflect on your mood, take a walk, or do a breathing exercise. It’s imperfect, but it’s one of the best implementations of mindfulness features we’ve seen thus far. Safety check is a proactive timer that notifies your loved ones of your location if you fail to check in. Photo by Amelia Holowaty Krales / The VergeGoogle has also introduced new personal safety features. Safety Check is a proactive timer that will send your location to loved ones if you’re in a pickle. You set an activity (i.e., taking public transportation or walking alone) and a timer duration. If you don’t check in when the timer goes off, your location will automatically be shared with your emergency contacts. Another neat feature is Safety Signal. If you get an LTE watch and have a Fitbit Premium subscription, you don’t need an active LTE plan in order to utilize emergency services.One thing to be mindful of is durability. While the domed display is beautiful, we cracked the screen on the original Pixel Watch and got deep scratches on the Pixel Watch 2. Google doesn’t offer any repair options, but with the Pixel Watch 2, it has started offering its Preferred Care extended warranty, so you have more replacement options should something happen. It’s not ideal since it’s limited to the US and Canada, but it’s a step in the right direction.Read my full Google Pixel Watch 2 review.Best fitness smartwatch for AndroidMobvoi’s long-awaited TicWatch Pro 5 has superior battery life, excellent fitness tracking, and Qualcomm’s new Snapdragon W5 Plus chip.Sizes: 50mm w/24mm straps / Weight: 44.3g / Battery life: Up to 80 hours / Display type: OLED touchscreen and secondary ultra-low power display / GPS: GPS, GLONASS, GALILEO, Beidou / Connectivity: Bluetooth, Wi-Fi / Water resistance: 5ATM / Music storage: 32GBMobvoi’s TicWatch lineup has its devoted fans for a reason: super long battery life. The $249.99 TicWatch Pro 5 is no exception. It’s got an estimated 80 hours of battery life with standard use, a secondary ultra-low power display, and a massive (for a smartwatch you wear on your wrist, at least) 628mAh battery. I didn’t quite get 80 hours in my testing, but I did get a solid 48-60 hours even with heavy GPS use. That outclasses most of the watches in this category and is useful for backpackers and endurance athletes. It might not hold a candle to a top-of-the-line Garmin, but it’s also a smarter watch for a fraction of the price.Battery life aside, Mobvoi’s watches are a great alternative to the Fossil Gen 6, and the Pro 5 is a good option for fitness-focused people who aren’t keen on giving up smart capabilities for a Garmin or Polar. It’s also more durable than Fossil’s fashion watches or the Pixel Watch. This time around, Mobvoi has also added a digital crown so you don’t have to worry about scrolling through menus with sweaty fingers. The flatter side button also reduces the risk of accidental presses.  The ULP display helps to extend battery life. Photo by Amelias Holowaty Krales / The VergeThe Pro 5 also has an ingenious method of displaying heart rate. When you lift up your arm, the backlight changes color depending on which heart rate zone you’re in. That means you can instantly gauge whether to up the intensity or slow your roll. The Pro 5 also adds new training metrics, like VO2 Max and recovery time. The TicWatch supports stress tracking, all-day blood oxygen monitoring, fatigue assessments, as well as atrial fibrillation and irregular heartbeat detection. For outdoorsy types, it also has access to multiple GNSS systems, and there’s a new barometer and compass app, as well as a one-tap measurement app that gives you a quick look at five metrics (heart rate, blood oxygen, stress, respiratory rate, and overall heart health). It’s also pretty capable on the productivity front. You get contactless payments, access to the Play Store, notifications, and the ability to take calls. It’s also the only Android smartwatch available in the US with the latest Qualcomm Snapdragon W5 Plus chip, which is a plus in terms of futureproofing. The only major concerns are the 50mm case that may not suit smaller wrists and the lack of a digital assistant. Read my full review of the Mobvoi TicWatch Pro 5.Best hybrid smartwatchThe Withings Scanwatch Light is a hybrid analog smartwatch that tracks the basics like steps and activities, while delivering up to 30 days of battery life.Sizes: 37mm with 18mm straps / Weight: 45g / Battery life: Up to 39 days / Display type: OLED display / GPS: Tethered GPS / Connectivity: Bluetooth / Water resistance: 5ATM / Music storage: N/AHybrid smartwatches are an excellent way to keep things simple and subtle. The $249.95 Withings ScanWatch Light gets you the basics like push notifications, timers, and alarms. On the health front, you can track steps, sleep, menstrual cycles, and GPS workouts. (That said, GPS is tethered from your phone, not built in.) The design reminds me of a classier Swatch, particularly if you get the more colorful options in a minty green or pale blue. But the big reason the Light has dethroned our previous pick, the Garmin Vivomove Sport, is its extra-long battery life. Withings estimates it lasts up to 30 days on a single charge, and I got pretty close to that in testing with 25 days. Despite the Vivomove’s more appealing $180 price tag, it only lasts about five days. The ScanWatch 2 (left) is a fancier version of the Light and has a few more health features. Photo by Amelia Holowaty Krales / The VergeIf you want a bit more out of a hybrid, you can also opt for the ScanWatch 2. It’s an extra $100, but you get EKGs and atrial fibrillation detection, temperature sensors, SpO2 readings, and an altimeter for measuring elevation. It also looks a bit more elegant on the wrist, partly because of a secondary dial that tracks your daily step progress. If neither matches your style, the Vivomove Sport is still a good option that gets you access to Garmin’s in-depth platform. Its Vivomove Trend is a slightly more upscale option that also supports Qi charging. Read my full review of the Withings ScanWatch 2 and Light.Best platform-agnostic fitness smartwatchGarmin Venu 3S$450The Garmin Venu 3S adds a new heart rate sensor, a wheelchair mode, and much-improved sleep tracking and nap detection. Sizes: 41mm w/ 18mm straps; 45mm w/ 22mm straps / Weight: 40g for the 3S; 47g for the 3 / Battery life: Up to 10 days for 3S; 14 days for 3 / Display type: OLED touchscreen / GPS: GPS, GLONASS, GALILEO / Connectivity: Bluetooth, Ant Plus, Wi-Fi / Water resistance: 5ATM / Music storage: 8GBGarmin is best known for making rugged GPS watches that have excellent fitness features but aren’t so smart otherwise. But the $449.99 Venu 3 caters to people who want top-notch fitness tracking without sacrificing productivity features. It’s got a colorful and vibrant always-on OLED display and comes in two sizes: 41mm and 45mm. Like its predecessor, the Venu 2 Plus, it also has a microphone and speaker so you can take and make calls directly from the wrist. It also has a clever workaround for digital assistants — it uses Bluetooth to work with whatever assistant is already on your phone. You’d think more fitness trackers would do this, but they don’t. It worked well in testing, though digital assistants aren’t always the smartest at understanding commands.The Venu 3 series is a little pricey, but it’s the smartest watch Garmin’s got to offer. Photo by Amelia Holowaty Krales / The VergeThe Venu 3 doesn’t have the best third-party app ecosystem, but it has Spotify, Deezer, and Amazon Music for offline playback. Android users can also send quick responses for texts, and the watch works with either iOS or Android for folks who want to keep their options open. It also has fall detection, live tracking, and contactless payments.As for health features, it has Garmin’s latest heart rate sensor, which enables its FDA-cleared EKG app to detect atrial fibrillation. Otherwise, you get built-in GPS, continuous heart rate monitoring, all of the advanced coaching features in the Garmin Connect app, and Garmin’s famous in-depth health data. The Venu 3 also improves sleep tracking with nap detection and adds audio-guided meditation sessions. There’s also a new wheelchair mode. This isn’t the most hardcore Garmin that money can buy, but it’s definitely the smartest. The price is a bit high compared to most smartwatches, but by Garmin standards, it’s middle-of-the-pack.Best budget Android smartwatchThe Amazfit GTR 4 is a platform-agnostic smartwatch that delivers a lot of bang for your buck. It has dual-band GPS, is Alexa-compatible, and has 14 days of battery life.Size: 46mm w/ 22mm straps / Weight: 34g / Battery life: Up to 14 days / Display type: OLED touchscreen / GPS: Dual-frequency and 6 GNSS systems / Connectivity: Bluetooth, Wi-Fi / Water resistance: 5ATM / Music storage: 2.3GBAmazfit’s made a name for itself making budget wearables that punch far above their weight. I’ve been consistently impressed by the GTR line of smartwatches over the years, and the $199.99 GTR 4 is no exception. Not only does it have a classic look, but you also get 14 days of battery life and a color, always-on OLED display. New to the GTR 4 is dual-band GPS — a feature that Apple and Garmin only recently introduced to their higher-end smartwatches. Or, if you like to plan your own trail runs or hikes, you can import your own GPS routes, too. It tracks 150 sports and features all-day continuous heart rate monitoring. You can also monitor stress, sleep, and SpO2 levels. For smart features, you can take calls on the wrist, and it has two digital assistants: Alexa and a proprietary offline assistant. The device also syncs with Strava and Adidas Running. The Amazfit GTR 4 is a budget option that punches above its weight. Photo by Victoria Song / The VergeThe GTR 4 isn’t the best smartwatch around. Flagship watches can do everything the GTR 4 can do but in a sleeker, more polished package. However, they can’t do it at this price. If price is your main priority, this gets you incredible bang for your buck. Plus, you can frequently find Amazfit devices on sale. The icing on the cake is it works just as well on Android as it does on iOS. Read my full review of the Amazfit GTR 4.Update March 18th, 10:12AM ET: Swapped Garmin Vivomove Sport with the Withings ScanWatch Light.",
    "created": 1710771123
  },
  {
    "kind": "article",
    "url": "TEST 29",
    "source": "The Verge",
    "title": "Sony is reportedly pausing PSVR 2 production to clear excess inventory",
    "text": "After producing in excess of two million units of its latest virtual reality headset, Bloomberg is reporting that Sony is hitting pause on production to try and shift its unsold inventory. The PlayStation VR2 launched last February for $549 as an accessory for the PlayStation 5, but IDC data suggests that shipments have declined each quarter since.Bloomberg suggests that the problem is a lack of content for the headset. The PSVR 2 is compatible with a handful of AAA games including Horizon Call of the Mountain, Gran Turismo 7, and entries in the Resident Evil series, as well as a range of smaller titles. But, at $549, the headset costs more than the PS5 itself, so expectations are high. Bloomberg notes that Meta and Apple have faced similar content challenges with their own headsets.As well as pausing production on the headset, Sony’s recent layoffs impacted teams that have worked on VR titles. It closed its London Studio and the developer behind Horizon Call of the Mountain, Firesprite studio, was also impacted. In total, the layoffs are expected to affect around 900 Sony employees, or 8 percent of its overall headcount.In an attempt to increase the amount of content available for its headset, Sony recently announced that it’s testing PC support, offering “the ability for PS VR2 players to access additional games on PC.” It’s currently unclear how widespread the headset’s support for PC titles might be, but support is planned for later this year.",
    "created": 1710760000
  },
  {
    "kind": "article",
    "url": "TEST 30",
    "source": "The Verge",
    "title": "Apple’s AI ambitions could include Google or OpenAI",
    "text": "Apple is reportedly in “active negotiations” with Google to bring its Gemini generative AI technology to the iPhone, Bloomberg reports, and has also considered using OpenAI’s ChatGPT.CEO Tim Cook has already confirmed that Apple is spending “a tremendous amount of time and effort” on artificial intelligence features, and plans to release them to its customers “later this year.” Bloomberg’s report suggests that the AI features built into Apple’s products could eventually be powered by a mix of first- and third-party AI models. Apple’s models could power on-device generative AI with iOS 18, releasing later this year, while cloud-based AI features like text- and image-generation could come via partnerships with the likes of Google.If a Google deal comes to fruition, Apple wouldn’t be the first company to have tapped the search giant to provide AI features on its phones. Earlier this year Samsung added a series of Galaxy AI-branded features to its Galaxy S24 smartphones, which are powered by Google’s AI technology. Google’s AI also appears prominently on its own Pixel 8 devices. The potential branding or implementation of Google’s AI tech into Apple’s devices is yet to be decided.The iPhone maker already has a longstanding deal with Google to make Google Search the default on its devices, in an agreement that’s believed to be worth $18 billion annually. But such deals have been increasingly contentious with regulators, with the US Department of Justice accusing Google of using them to unfairly entrench its search engine’s market position.A potential AI deal between Apple and Google could expand the reach of Google’s AI tools to the over 2 billion iPhones Apple currently has in the market. But Bloomberg notes that it risks being a concession from Apple that its own generative AI technology is lagging behind its competitors. Apple employees have apparently been testing an in-house chatbot called Apple GPT, and the company reportedly has its own large language model codenamed Ajax, but Apple’s AI tech is said to be less advanced than the competition.It sounds like we might have a while to wait to hear if Apple ends up signing its AI deal with Google, with Bloomberg noting that any such deal is unlikely to be announced before WWDC in June.",
    "created": 1710754234
  }
]