[
    {
      "kind": "article",
      "url": "TEST 31",
      "source": "YC HACKER NEWS",
      "title": "European Space Agency to measure Earth at millimeter scale",
      "text": "The European Space Agency has committed €76.6 million ($83 million) toward the development of Genesis – a flying observatory that will provide positioning services accurate to a single millimeter.\nThe cash is roughly one third of the €233 million ($253 million) awarded for contracts related to position calculating satellite systems that was announced on Tuesday.\nGenesis is expected to provide International Terrestrial Reference Frame (ITRF) – a global coordinate system that precisely defines the positions and movements of Earth, down to that single millimeter of accuracy with a long-term stability of 0.1mm per year.\n\n    \n\nThe satellite will accomplish this by having the usual main Earth-measuring techniques co-located on board – including satellite navigation ranging, very-long-baseline interferometry, satellite laser ranging and a system that uses Doppler shift in radio signals between ground stations and satellites to determine satellite positions known as Doppler Orbitography and Radio positioning Integrated by Satellite (DORIS). All will be synchronized by an ultra-stable oscillator (USO).\n\n        \n\n\n        \n\nWhen used together, the ESA expects to be able to correct for biases inherent in each technique.\n\"Genesis, by co-locating all four geodetic techniques on the same satellite and with properly calibrated and synchronized instruments, will give results on Earth's measurements that have never been seen before,\" declared Genesis prime contractor OHB Italia's managing director, Roberto Aceti.\n\n        \n\nLast year, the ESA applauded the 20cm horizontal and 40cm vertical accuracy achieved by the then-new High Accuracy Service (HAS). At the time Europe's satnav fleet, Galileo, with its 28-satellite constellations and worldwide ground segment, was considered the world's most precise satellite navigation system.\nAnd while 20cm resolution is fairly accurate as a measurement of Earth, a single millimeter is quite a lot more so.\n\"An updated International Terrestrial Reference Frame (ITRF) will have immediate benefits on satellite-based systems, impacting Galileo-enabled applications in fields like aviation, traffic management, autonomous vehicles, positioning and navigation,\" reasoned the ESA in its Tuesday announcement.\n\n        \n\nThe space agency added that meteorology, natural hazard prediction, monitoring climate change effects, land management and surveying – as well as the study of gravitational and non-gravitational forces as fields – would also see benefits.\n\n\nGPS interference now a major flight safety concern for airline industry\n\nNASA warns as huge solar flare threatens comms, maybe astronauts too\n\nESA salutes Galileo satellite system meeting aviation standards\n\nVoyager 1 starts making sense again after months of babble\n\nThe rest of the contract money – two separate €78.4 million (US$85.2 million) chunks – was designated for the Low Earth Orbit Positioning Navigation and Timing demonstrator, or the LEO-PNT.\nThe prime contractor for one of the LEO-PNT demonstrator contracts is GMV Aerospace and Defence, the other is Thales Alenia Space.\nLEO-PNT is a small constellation of demonstration satellites that test the use of novel signals and frequency bands to improve positional accuracy, working in conjunction with Galileo and other satnav systems.\n\"LEO-PNT will assure signals to improve robustness of existing GNSS in medium Earth orbit such as natural phenomena impairments and interferences, and provide services to places where today's satnav systems cannot reach – deep urban areas and even indoors,\" explained the space agency.\nThe device will also, hopefully, demonstrate the interoperability of positioning navigation and timing with open communication standards, including 5G and 6G, which could allow for new IoT applications, emergency services and low latency data for positioning and timing.\nBoth the Genesis device and the LEO-PNT demonstrator were first announced in 2022 and are new missions within the FutureNAV program, which seeks to continue modernizing satnav technology.\nGenesis is scheduled to launch in 2028, while LEO-PNT should have a completed constellation in orbit before 2027. ®",
      "author": "pseudolus",
      "created": 1710931215,
      "comments": 14,
      "likes": 77
    },
    {
      "kind": "article",
      "url": "TEST 32",
      "source": "YC HACKER NEWS",
      "title": "SUSE Upgrades Its Rancher Kubernetes Management Family",
      "text": "KubeCon/CloudNativeCon\nAt KubeCon Europe in Paris this week, SUSE updated both its Rancher container management and edge computing platforms with more security and automation.\nRancher, SUSE‘s popular complete software stack for running and managing multiple Kubernetes clusters across any infrastructure, comes in two main commercial versions: SUSE Rancher Prime and SUSE Edge. So, as you might expect, SUSE announced major updates, Rancher Prime 3.0 and Rancher Edge 3.0, at KubeCon+CloudNativeCon EU, being held in Paris this week.\nRancher Prime 3.0, SUSE’s commercial iteration of the open source enterprise container management platform Rancher, is at the heart of these enhancements. The update introduces features designed to empower platform engineering teams to offer developers self-service Platform as a Service (PaaS) capabilities alongside bolstered support for AI workloads.\nAs always, Rancher Prime supports any certified Kubernetes distribution. It streamlines cluster operations, offering provisioning, version management, monitoring, and centralized audit capabilities. You can also use it to automate processes and enforce consistent security policies across all clusters, regardless of their location.\nIn this latest version, Rancher Prime enhances security through Supply-chain Levels for Software Artifacts (SLSA, pronounced Salsa)  certification and the provision of software bill-of-materials (SBOM), ensuring trusted deliveries for enterprises. Putting this into use, Rancher Prime introduces the general availability of the Rancher Prime Application Collection. This is a curated library of minimal, hardened developer and infrastructure images with signatures and SBOMs.\nSUSE also uses NeuVector 5.3.0 to bring open source zero trust to the platform. In addition to securing the containers, Rancher Prime also uses NeuVector’s layer seven network application inspection capabilities as a firewall. For example, it checks on DNS for fully qualified domain names (FQDNs), into IP addresses to make sure external connections are legitimate.\nAnother key enhancement is bundling in Harvester 1.3.0. This enables you to create and use virtual GPUs (vGPUs). In Kubernetes, a vGPU is a mediated device that allows multiple VMs to share the compute capability of a physical GPU. You can assign a vGPU to one or more VMs created by Harvester. Harvest also enables hyper-converged infrastructure (HCI) deployments. These are highly optimized platforms that tightly integrate compute and storage.\nIn addition, the Certified Kubernetes distributions RKE2 and K3s have been enhanced to automatically detect and configure the use of NVIDIA’s container runtimes. Put this all together, and if you’re considering moving AI and ML to Kubernetes, Rancher demands your attention.\nThe Rancher Prime software family has an 18-month lifecycle. This comes complete with support, security patches, and maintenance updates.\nThe SUSE Edge 3.0 stack release is based on Prime, but it’s designed to run in resource-constrained, remote locations with intermittent Internet connectivity. Edge 3.0 is underpinned by SUSE Linux Enterprise (SLE) Micro and the Cloud Native Computing Foundation CNCF-certificated Kubernetes distributions, K3s/RKE2. This gives you all you need to support containers, virtual machines, and microservices.\nAll of these programs will become generally available in April 2024. SUSE has its eye on more than just its latest commercial offerings, though.\nAs Peter Smails, SUSE Enterprise Container Management business unit general manager, said in a statement, “At SUSE, our commercial and open source users are equally important We need to deliver the capabilities our enterprise customers require in order to deploy and manage their business-critical production workloads, while also continuing to invest in innovation to support and grow our huge community of open source users.”\n\n\n\n\n\n\n\n\n\nYOUTUBE.COM/THENEWSTACK\n\n\nTech moves fast, don't miss an episode. Subscribe to our YouTube\nchannel to stream all our podcasts, interviews, demos, and more.\n\n\n\n\n\n\n\n\nGroup\nCreated with Sketch.",
      "author": "CrankyBear",
      "created": 1711024394,
      "comments": 3,
      "likes": 10
    },
    {
      "kind": "article",
      "url": "TEST 33",
      "source": "YC HACKER NEWS",
      "title": "Alibaba promises server-class RISC-V processor in 2024",
      "text": "Alibaba's research arm, the Damo Academy, has promised to deliver a server-grade RISC-V processor later this year, showed off a RISC-V-powered laptop running the open source cut of Huawei's CentOS spinout, and talked up a growing community working on the permissively licensed CPU instruction set architecture.\nNews of the forthcoming server processor – dubbed the C930 – emerged at last week's Xuantie RISC-V Ecological Conference held in Shenzhen. Numerous Chinese media reported that Damo reps announced the imminent debut of a processor that, like other chips cooked up by the Alibaba lab and its T-Head chip design unit, are aimed at server-class workloads. It's 2024, so that means AI is also on the agenda.\nDetails of the chip were not discussed.\n\n    \n\nBut Damo Academy folk did discuss a new laptop called the RuyiBOOK that will run the T-Head C910. That chip, curiously, no longer appears on the chip designer's website but the Wayback Machine reveals that it offered between one and four cores, a 12-stage superscalar pipeline optimized for arithmetic operations, and a design suitable for edge servers, AI, and telecoms applications.\n\n        \n\n\n        \n\nNow it's apparently suitable for laptops, too.\n\n\nFrench cloud Scaleway starts renting Alibaba's RISC-V SoC\n\nLeaked docs hint Google may use SiFive RISC-V cores in next-gen TPUs\n\nMIPS snags top SiFive brains to amp up RISC-V business\n\nChina's Loongson debuts processor that 'matches Intel silicon circa 2020'\n\nInterestingly, this laptop runs openEuler – the open version of the EulerOS that Huawei created by adapting Red Hat Linux. It also runs Ding Talk – Alibaba's Zoom-and-Teams-like collaboration suite – and Libre Office.\nA device that can run those packages will well and truly do the job for many Chinese knowledge workers and consumers – without relying on US tech.\nReports out of the Ecological Conference suggest another topic of conversation was a \"swordless alliance\" of Chinese tech companies committed to advancing the local RISC-V ecosystem.\n\n        \n\nIt's not hard to see why Chinese tech giants would want to do so: US-led sanctions mean they may never again see the most advanced silicon designs developed by the likes of Nvidia, Intel, AMD, and Arm. Creating their own alternatives may be the only way forward, and the RISC-V license gives Chinese chip shops plenty to work with.\nIt does the same India's techs, and indeed India has prioritized developing its own RISC-V processors. So far, India has little to show for that effort, and has missed deadlines for revealing designs more sophisticated than its current very modest 32-bit offerings. ®",
      "author": "topspin",
      "created": 1711012658,
      "comments": 4,
      "likes": 14
    },
    {
      "kind": "article",
      "url": "TEST 34",
      "source": "YC HACKER NEWS",
      "title": "Hyperscript",
      "text": "An easy & approachable language for modern web front-ends\nEnhance HTML with concise DOM, event and async features. Make writing interactive HTML a joy.\n\n\n\non pointerdown\n  repeat until event pointerup\n    set rand to Math.random() * 360\n    transition\n      *background-color\n      to `hsl($rand 100% 90%)`\n      over 250ms\n  end\n\n\n\n\nInstall: <script src=\"https://unpkg.com/hyperscript.org@0.9.12\"></script>\n\n\n\n\n\n\n Events are first class citizens\n\n<button _=\"on click send hello to <form />\">Send</button>\n\n<form _=\"on hello alert('got event')\">\n\n\n\nHighly interactive user experiences without promises, async / await or callback hell.\n_hyperscript transparently handles asynchronous behavior for you.\n\n<div _=\"on click wait 5s send hello to .target\">\n\n<div _=\"init fetch https://stuff as json then put result into me\">Using fetch() API...</div>\n\n Enhance existing code\n\n<div _=\"init js alert('Hello from JavaScript!') end\"></div>\n\n<div _=\"init js(haystack) return /needle/gi.exec(haystack) end\">\n\n<div _=\"install Draggable(dragHandle: .titlebar)\">\n\n Remember HyperCard?\n\n<div _=\"on click tell <p/> in me add .highlight\">\n\n<div _=\"tell <details /> in .article set you.open to false\">\n\n Debugging and extending\nGraphically debug and step through code as it runs.\non click breakpoint\n\n_hyperscript is natively extensible.\nAdd new commands or expressions using vanilla javascript.\n_hyperscript.addCommand(\n  \"foo\",\n  (parser, rt, tokens) => ...)",
      "author": "tosh",
      "created": 1711027359,
      "comments": 11,
      "likes": 51
    }
]